[
  {
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tcs-pvr-inox-senco-gold-jsw-cement-maruti-suzuki/articleshow/124402285.cms",
    "title": "Stocks in news: TCS, PVR Inox, Senco Gold, JSW Cement, Maruti Suzuki",
    "content": "Markets traded sideways on Wednesday and ended with a mild downtick, taking a breather after the recent surge.With the earnings season underway, focus now shifts to TCS’s quarterly results, scheduled for Thursday, October 9. As IT remains one of the lagging sectors, market participants will closely watch how sentiment evolves post its numbers.On the index front, analysts said indications point toward further consolidation, albeit with a positive bias. In today's trade, shares of TCS, PVR Inox, Senco Gold, JSW Cement, Maruti Suzuki among others will be in focus due to various news developments.TCSTCS will kick off the earnings season on Thursday, with brokerages estimating Q2 net profit growth of 3.7%–9.6% YoY, pegging the bottomline between Rs 12,346 crore and Rs 13,058 crore. Revenue is projected in the range of Rs 64,200–65,700 crore, reflecting a 0.7%–2.2% uptick compared to the same quarter last year.PVR InoxPVR Inox launched 'dine-in cinema', claimed to be India's first, at M5 ECity Mall in Bengaluru. The multiplex operator said the dine-in cinema is a first-of-its-kind experience where \"blockbuster films meet gourmet dining\". This format transforms the cinema into a lifestyle destination, giving audiences the freedom to enjoy chef-curated meals in-seat, without stepping out of the auditorium or even purchasing a movie ticket.LupinDrug firm Lupin will set up a new manufacturing facility in Coral Springs, Florida, entailing an investment of $250 million. The Florida-based plant would produce products like albuterol inhalers for children with asthma. By strengthening domestic manufacturing and enhancing supply chain diversification, this critical project will enhance medicine security and strengthen the company's position as a global respiratory leader, it said.Maruti SuzukiMaruti Suzuki India said it plans to add a total of 500 service workshops to its network in the current fiscal. The auto major announced the setting up of its 5,000th Arena Service touchpoint in Coimbatore. The company sells its product range in the country through Arena and Nexa sales networks.JSW CementJSW Cement, part of diversified $23-billion JSW Group has commissioned a 1 MTPA (million tonnes per annum) capacity cement grinding unit at Sambalpur in Odisha. The unit, which will take the company's total installed capacity to 21.6 MTPA, is being commissioned through its subsidiary, Shiva Cement, according to a statement.Senco GoldJewellery retailer Senco Gold reported a 6% YoY growth in total revenue for the second quarter (Q2FY26), despite headwinds from record-high gold prices and seasonal factors.Saatvik Green EnergySeptember listed Saatvik Green Energy posted a 459% jump in its consolidated net profit for the June ended quarter at Rs 119 crore versus Rs 21 crore reported in the year ago period. The profit after tax (PAT) is attributable to the owners of the group.",
    "scraped_at": "2025-10-09T08:21:36.456951+05:30"
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-revenue-to-inch-up-margins-may-shrink-in-q2/articleshow/124402208.cms",
    "title": "TCS revenue to inch up, margins may shrink in Q2",
    "content": "ET Intelligence Group: Tata Consultancy Services may report a modest sequential uptick in dollar denominated revenue for the September quarter compared with a drop in the previous quarter. However, the operating margin (EBIT margin) and net profit may show weakness amid lower employee utilisation and the impact of partial salary increase. The company will declare the quarterly numbers on Thursday after market hours.According to the average of the estimates by ETIG and six brokerages, the country's largest IT exporter will report 0.6% sequential growth in revenue at $7,473 million after posting a 0.6% fall in the prior quarter. In rupee terms, the growth rate will be higher at 2.8% taking the revenue to ₹65,242.4 crore due to favourable currency movement during the quarter. The rupee depreciated by 2% sequentially against the dollar during the quarter on average. A weaker domestic currency improves realisation of exporters. Agencies\"TCS is expected to post revenue growth of 1.0% quarter-on-quarter in constant currency terms, with international business growing by around 1% and India flat,\" mentioned Motilal Oswal Financial Services in a preview report. The broking firm expects a ramp up in the BSNL project from the December quarter. A winding down in the local telecom operator's 4G project had pulled down the top line in the previous quarter by 2.8% taking the total revenue drop to 3.3% in constant currency terms.The operating margin is expected to shrink by 10-20 basis points from 24.5% in the previous quarter following partial wage increase and lower utilisation. Net profit is likely to fall by 1.6% sequentially to ₹12,560.5 crore. In the prior quarter, it had risen significantly by 4% on account of one-time tax refund.\"We expect TCS to report a 20 basis points sequential contraction in margin given the impact of one month wage hike and lower utilisation,\" stated Elara Capital in a preview report highlighting that the non-recurring nature of the tax refund would impact profitability sequentially.The stock has lost 11% since July 09 when the company had declared the June quarter numbers following demand weakness. In this backdrop, investors would keenly track the September quarter performance to find cues on the deal pipeline and its conversion rate, hiring and margin outlook among other factors.",
    "scraped_at": "2025-10-09T08:21:36.56218+05:30"
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/kyc-a-challenge-have-to-simplify-norms-sbi-chief/articleshow/124402003.cms",
    "title": "KYC a challenge, have to simplify norms: SBI chief",
    "content": "Mumbai: State Bank of India chairman CS Setty called upon policymakers, fintech developers and technology developers to think about ways to simplify the know your customer (KYC) process, which he termed one of the biggest challenges for banks as well as customers.Banks employ KYC to onboard customers and simplifying the process is important for a large number of people who are joining mainstream banking.\"I think one (of the) biggest subjects both on the customer side and the bank side... it's about KYC. We are working on the simplification of KYC processes. Even if it means that we need to engage with the regulators and the government, we are taking that initiative from the SBI side to simplify the whole process of KYC,\" Setty said Wednesday.Under YONO 2.0, the upcoming version of SBI's digital platform, the bank plans to offer the option of multiple languages, he said. \"Almost 15 languages will be available in YONO 2.0. And we would like to focus on how we make more and more products available for farmers, MSME (micro, small and medium enterprises) customers, and also the branch and community customers,\" Setty said. SBI is focusing on physical presence as well, he said, adding, \"We have about 1.6 lakh touch points. It is not only digital channels; we are also reimagining physical outlets to ensure services are accessible across the country.\"",
    "scraped_at": "2025-10-09T08:21:36.724472+05:30"
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/shift-to-new-provisioning-ways-to-have-little-impact-sbi-chairman-cs-setty/articleshow/124401996.cms",
    "title": "Shift to new provisioning ways to have little impact: SBI chairman CS Setty",
    "content": "Mumbai: The long transition provided to banks on the new expected credit loss (ECL) provision guidelines will limit the impact on bank balance sheets, State Bank of India (SBI) chairman CS Setty said Wednesday.The comments came a day after the Reserve Bank of India (RBI) issued a draft circular on the ECL framework, which will replace incurred-loss-based provisioning framework that banks use currently.The central bank has proposed 100% provisions against unsecured loans after one year of these loans being classified as credit impaired, while all other categories of loans will attract 100% provisions after four years of such classification.In a big relief to banks, the RBI has proposed that the new norms come into effect only from April 1, 2027. Besides, banks will get four years, till March 31, 2031, to make additional provision on their existing books. The central bank has invited public comments on the draft guidelines until November 30 following its announcement in the monetary policy review last week. Setty said SBI is ready technologically, in terms of models and networks to implement the new guidelines.",
    "scraped_at": "2025-10-09T08:21:36.839051+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/economy/rbi-likely-to-hold-policy-in-october-decision-may-shift-to-december-hdfc-bank-alpha-article-19688443.htm",
    "title": "RBI likely to hold policy in October, decision may shift to December: HDFC Bank",
    "content": "HomeEconomy NewsRBI likely to hold policy in October, decision may shift to December: HDFC BankThe Reserve Bank of India’s upcoming policy and the government’s second-half borrowing programme are in focus as bond market participants weigh inflation, growth, and liquidity trends.Arup Rakshit, Group Head of Treasury at HDFC Bank, said a rate cut by the Reserve Bank of India (RBI) is unlikely in the October policy. “October, to me, looks a little difficult to change any stance,” he noted, citing geopolitical uncertainty and tight liquidity. He said the RBI may reassess in December depending on growth trends and tariff clarity.\n\nRakshit said liquidity conditions have tightened temporarily, while Shailendra Jhingan, Head of Treasury and Economic Research at ICICI Bank, pointed out that “Core liquidity is still at a very huge surplus of 5 trillion (lakh croer).” Both indicated that open market operations (OMOs) could come later if needed.\n\nAlso Read | Rupee may weaken further as tariffs, visa rules and gold imports add pressure: BNP Paribas\n\nThe government is expected to borrow ₹6.82 lakh crore in the second half of the fiscal year 2025-26 (FY26), after raising ₹8 lakh crore in the first half. Rakshit said, “We don’t expect it to be more than 6.8 trillion (lakh crore). They will manage it,” while Jhingan said the government has buffers such as higher small savings and the RBI dividend to prevent slippage.\nJhingan said inflation is running well below the RBI’s 4% target. “Our target for the current average inflation is 2.4%,” he said, adding that even excluding vegetables, inflation stands at 3.7% after goods and services tax (GST) cuts. According to him, core inflation could fall to 3%, creating “scope to cut rates.”\n\nAlso Read | CEO Sentimeter: Top 5 challenges faced by Indian Inc amid global uncertainty\n\nOn growth, Jhingan projected real gross domestic product (GDP) at 7% this year but warned of slowing nominal growth. “In the fiscal year 2022-23 (FY23), nominal GDP growth was 14%. It came down to 12% in 2023-24 (FY24), 9.7% in 2024-25 (FY25) and this year we expect 8.5%,” he said, stressing that policymakers should watch the trend closely as it affects debt sustainability and profit growth.\n\nBoth agreed that demand for long-tenure bonds has weakened. Jhingan noted that institutional investors are allocating more to equities, while Rakshit said some supply may shift to the five-to-seven-year bucket, which could “bring in a little bit of demand” and ease yields.\n\nFor the full interview, watch the accompanying video\n\nCatch all the latest updates from the stock market here",
    "scraped_at": "2025-10-09T08:21:37.983939+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/economy/india-shipbuilding-subsidy-tk-ramachandran-maritime-domestic-and-foreign-ships-alpha-article-19688332.htm",
    "title": "Shipping Secretary outlines ₹70,000 crore plan to boost shipbuilding, cut import reliance",
    "content": "HomeEconomy NewsShipping Secretary outlines ₹70,000 crore plan to boost shipbuilding, cut import relianceTK Ramachandran, Secretary of Ports \u0026 Shipping, highlights that 95% of India’s cargo is currently transported on foreign vessels, emphasising the need to de-risk shipping and develop domestic fleets, shipyards, and maritime capacity.The Indian government has launched a scheme to support shipyards and reduce the cost difference between buying a ship abroad and building one in India.\n\nThis difference is usually around 15 to 20%, and under the plan, shipbuilders can receive a subsidy of 15 to 25%, depending on the size of the ship and whether it is an environmentally friendly vessel, said TK Ramachandran, Secretary of Ports \u0026 Shipping.\n\nThe Union Cabinet approved shipping and maritime projects worth about ₹70,000 crore on September 24. The initiative includes a financial assistance scheme for shipbuilding valued at nearly ₹45,000 crore and a maritime development fund of around ₹25,000 crore.\n\nCurrently, India has limited shipbuilding capacity, with only a few public and private shipyards like Cochin Shipyard, Pipavav, and L\u0026T.\n\nCountries like Korea, Japan, China, and Vietnam produce far more ships each year. The new scheme will provide subsidies of up to 25% to improve infrastructure at existing shipyards and expand capacity.\n\nThe government’s goal is to reduce dependence on foreign vessels. At present, 95% of India’s cargo is carried on foreign ships, highlighting the need for self-reliance in shipping.\n\nRamachandran stated that India aims to develop its own fleet and shipbuilding capabilities to de-risk its maritime trade.\n\nThe government has also granted infrastructure status to certain classes of large ships built or registered in India. This move is expected to facilitate easier financing and promote private investment in the sector.\n\nTo further address the lack of financing in shipping, a Maritime Development Fund of ₹20,000 crore has been launched, with the government contributing 49% and the remainder expected from private equity, sovereign funds, and pension funds.\n\nThis is projected to attract about ₹1.45 lakh crore in total investments into the shipping sector.\n\nThe government aims to break the vicious cycle of limited financing, which has historically restricted ship manufacturing and yard capacity. A dedicated shipbuilding development scheme worth ₹19,989 crore is being set up to create two to three mega shipbuilding clusters in India.\n\nRamachandran noted that the scheme has already generated strong interest from investors and shipbuilders in countries including the US, UK, Greece, Japan, and South Korea.\n\nWatch the accompanying video for more",
    "scraped_at": "2025-10-09T08:21:38.146027+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/economy/another-25-bps-rate-cut-best-possible-option-for-rbi-sbi-study-ws-l-19684146.htm",
    "title": "Another 25 bps rate cut best possible option for RBI: SBI study",
    "content": "HomeEconomy NewsAnother 25 bps rate cut best possible option for RBI: SBI studySBI study urges RBI to consider a 25 basis point rate cut in September as CPI inflation is expected to stay benign, ahead of the MPC meeting.A SBI study released on Monday (September 22) stated that there is merit and rationale for the Reserve Bank to reduce the key benchmark lending rate by 25 basis points in the forthcoming monetary policy, as retail inflation is expected to remain benign even in the next financial year.\n\nThe Reserve Bank of India (RBI) has already reduced the repo rate by 100 basis points since February, amidst declining consumer price index (CPI) based inflation. After reducing the repo rate three times in a row, the RBI hit a pause button in August.\n\nThe Reserve Bank Governor-headed Monetary Policy Committee (MPC), which decides on the interest rate, is scheduled to meet on September 29 for a three-day deliberation. The decision will be announced on October 1.\n\n”There is merit and rationale in going for a September rate cut…This will but require calibrated communication by the RBI as post June, the bar for rate cut is indeed higher,” said ’Prelude to MPC Meeting’, the research report from the State Bank of India’s Economic Research Department.\n\nIt further said central bank communication is a crucial toolkit for monetary policy, and post-June policy, such communication has played a major role in yields hardening.\n”But there is no point in committing a Type 2 error again (no rate cut with neutral stance) by not cutting rates in September as inflation will continue to remain benign even in FY27, and without a GST cut, it is tracking below 2% in September and October,” it said.\n\nThe report said the CPI for fiscal 2026-27 numbers are now tracking around 4% or less, with GST rationalisation, October CPI could be closer to 1.1%, the lowest since 2004.\n\n”A rate cut in September is the best possible option for RBI, which also projects it as a forward-looking central bank,’ the SBI study said.\n\nThe report, authored by Soumya Kanti Ghosh, Group Chief Economic Advisor of SBI, expects the CPI inflation may further decline by 65-75 bps due to the huge GST rationalisation.\n\nExperience of 2019 also indicates that the rates rationalisation (primarily focused on reducing rates for common goods to 18% from 28%) led to almost 35 bps decline in overall inflation in just a couple of months, it said.\n\n”Additionally, with the new CPI series, we expect further moderation of 20-30 bps in CPI. All these factors (GST, base revision) indicate that CPI inflation will remain around lower end of inflation target for the entire FY26 and FY27,” it said.\n\nThe government has mandated the RBI to ensure the CPI remains at 4% with a margin of 2% on either side.",
    "scraped_at": "2025-10-09T08:21:38.307139+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/economy/gst-rate-cuts-from-september-22-full-faq-on-exemptions-itc-rules-and-cbic-notifications-19682279.htm",
    "title": "GST rate cuts from September 22: Full FAQ on exemptions, ITC rules and CBIC notifications",
    "content": "Starting September 22, 2025, India will see sweeping GST rate cuts and exemptions across multiple sectors, following decisions of the GST Council. The revised structure, notified through official CBIC notifications, is aimed at simplifying rates, removing anomalies, and ensuring smoother compliance for businesses and consumers alike.\n\nFrom medicines, insurance, and transport services to ITC claims, e-way bills, and stock already in trade, the changes raise practical questions for taxpayers. Should old stock be billed at the new rates? What happens to advances received earlier? How will exemptions impact input tax credit?\n\nTo help businesses, professionals, and consumers navigate this transition, here’s a complete FAQ on the revised GST rates, with clear answers on exemptions, ITC treatment, invoicing, and compliance under the new regime.\n\nHere's your guide:\n\nWhat is GST?\n\nGST (Goods and Services Tax) is a single indirect tax on the supply of goods and services across India. It replaces multiple taxes like excise, VAT, and service tax, creating one unified market.\n\nFrom when will the revised GST rates come into effect?\n\nThe new GST rates will apply from 22nd September, 2025, as recommended by the GST Council.\n\nWhat has changed in GST from 22nd September 2025?\n\nFrom this date, revised GST rates on several goods and services come into effect, based on the GST Council’s decisions. The changes aim to simplify rates, remove anomalies, and make the system easier for both businesses and consumers.\n\nWill GST registration rules change from 22nd September 2025?\n\nNo. The threshold limits for GST registration remain the same. Only the tax rates on certain supplies are being revised.\n\nWhich notification will notify the revised GST rates?\n\nThe changes will be notified through official rate notifications issued by the Government. These notifications are available on the CBIC website.\n\nWhat will be the applicable rate of tax if goods or services were supplied before the GST rate change, but the invoice was issued later?\n\nIn such cases, the “time of supply” rules under Section 14 of the CGST Act will decide the applicable rate. If both supply and payment were made before 22nd September, the earlier rate will apply. However, if supply was before but invoice or payment comes after 22nd September, the revised rate will be charged.\n\nWhat GST rate will apply if advances were received before the rate change but the supply or invoice is issued later?\n\nThe rate depends on the timing of the advance. Advances received before 22nd September will be taxed at the old rate. If the advance is received on or after 22nd September, or if the supply is completed later, GST will apply at the revised rate.\n\nWill e-way bills need to be cancelled and reissued for goods in transit when the new GST rates take effect?\n\nNo. E-way bills issued before the rate change remain valid for their full duration. Goods already in movement with a valid e-way bill do not need a fresh bill after 22nd September.\n\nIf I already hold stock on the date of the rate change, should I apply the revised rate on supply?\n\nYes. GST is charged on the date of supply, not on the date of purchase. So, even if the stock was purchased earlier, any supply made on or after 22nd September will attract the new rate.\n\nWhat will happen to ITC on purchases made before the change in GST rates? Will you get ITC at a reduced rate now?\n\nYou can claim full ITC (Input Tax Credit) on purchases made before the rate change, as long as GST was charged correctly at that time. The later change in rates will not reduce the credit already available to you. In short, whatever tax you paid earlier remains valid credit in your GST ledger.\n\nMy outward supply is exempt under the new rate schedule, but I already have ITC in my ledger. Do I need to reverse it?\n\nYou can use the ITC balance for supplies made up to 21st September, 2025. But from 22nd September, once your supply becomes exempt, the ITC related to it cannot be used and must be reversed as per GST rules.\n\nWill I be allowed to claim refund of accumulated credit under inverted duty structure for supplies made up to the effective date of the revised rate?\n\nNo. Refund of accumulated ITC under inverted duty is available only where inputs are permanently taxed at a higher rate than outputs. If the difference is only because of a rate change over time on the same goods, refund is not allowed.\n\nWhich life insurance policies are covered under the GST exemption?\n\nThe exemption applies to all individual life insurance policies, including term plans, endowment policies, and ULIPs. Reinsurance of these individual policies is also exempt.\n\nWhich health insurance policies are covered under the GST exemption?\nIndividual health insurance policies, including family floater and senior citizen plans, are exempt from GST. Reinsurance of such individual policies is also exempt under this decision.\n\nIn addition to exempting individual health and life insurance services, will any input services of insurers also be exempted?\n\nOnly reinsurance services are exempt. Other inputs, such as commissions and brokerage, remain taxable, and insurers cannot claim ITC on them once the output supply is exempt. Such ITC will have to be reversed.\n\nWill passenger transportation services be taxed at 18%?\n\nNo. Passenger transport by road will continue at 5% without ITC, though operators may opt for 18% with ITC. In the case of air travel, economy class is taxed at 5%, while other classes remain at 18%.\n\nWhat is the applicable GST rate on multimodal transport of goods?\n\nIf the multimodal transport does not include any air leg, it is taxed at 5% with limited ITC (restricted to 5% of the value). If any portion involves air transport, the applicable rate is 18% with full ITC.\n\nWho is liable to pay GST on local delivery services provided through an ECO?\n\nIf local delivery services are provided through an e-commerce operator (ECO) by an unregistered person, the e-commerce operator is responsible for paying GST. If the service provider is registered, then that provider is liable to pay the tax.\n\nWhat is the GST rate applicable on local delivery services?\n\nLocal delivery services are taxed at 18%. If the supplier is registered, the supplier pays GST. If the supplier is unregistered and provides services through an e-commerce platform, the operator pays GST.\n\nAre local delivery services provided through an ECO covered under the scope of GTA?\n\nNo. Local delivery services through e-commerce platforms are not considered as Goods Transport Agency (GTA). They are treated as a separate category of service.\n\nIs it necessary to recall and re-label the MRP on medicines already in the supply chain before 22nd September, 2025? How will the re-labelling be carried out?\n\nNo recall of stock is required. Manufacturers only need to issue revised price lists and share them with dealers, retailers, and regulators. Stock already in the market can continue to be sold, provided billing reflects the new prices.\n\nWhy haven’t all medicines been fully exempted from GST?\n\nExempting medicines would prevent manufacturers from claiming ITC on raw materials and inputs, raising their production costs. These costs would eventually be passed on to consumers. Keeping medicines at a concessional 5% rate (except those specified at nil rate) ensures affordability while allowing ITC to flow through the supply chain.\n\nWhy hasn’t agricultural machinery been fully exempted from GST?\n\nIf agri-machinery is made fully tax-free, manufacturers lose input tax credit on raw materials, raising their costs. These higher costs would be passed on to farmers, making machinery more expensive. Hence, it is kept taxable at a concessional rate to balance relief for farmers and viability for manufacturers.\n\nWhy hasn’t GST been removed on raw cotton?\n\nCotton is taxed under reverse charge, so farmers do not pay GST directly. This system keeps the input tax credit chain intact for the textile industry, which helps keep costs stable and benefits consumers.\n\nWill technical textiles like geotextiles and agro-textiles face greater inversion since they mainly use plastic components such as polyethylene and polypropylene?\n\nTechnical textiles like geotextiles and agro-textiles are treated as textiles, not plastics, under the international classification system adopted by India. While some inversion may remain, GST allows the refund of accumulated input credit in such cases. With process reforms, these refunds will be processed faster, ensuring that manufacturers are not burdened.\n\nWhat is the tax treatment for leasing or renting services without an operator?\n\nThe majority of leasing or renting without operator is taxed at the same rate as the goods themselves. For example, if a car is taxed at 18%, then renting or leasing that car without a driver is also taxed at 18%. The same rule applies to other goods; the tax on renting matches the tax on buying.\n\nWill the revised GST rates also apply to imported goods?\n\nYes. IGST on imports will be levied at the revised GST rates from 22nd September, except where a specific exemption has been provided.\n\n(Ultra High Temperature) milk has been exempted. Does this exemption also apply to plant-based milk?\n\nNo. The exemption is only for dairy UHT milk. Plant-based milk drinks (like almond milk) earlier attracted 18% GST, and soya milk drink 12%. Now all plant-based milk drinks, including soya milk, will be taxed at 5%.\n\nWhy has GST on face powders and shampoos been reduced, and will this not also benefit MNCs and luxury brands?\n\nFace powders and shampoos are common household items used across all sections of society. While premium or luxury brands will also see the benefit, the main purpose of the rate cut is to simplify the GST system. Having separate rates based on brand or price would make the tax structure complicated and difficult to administer.\n\nWhy is refund of inverted duty on imitation zari made from metallised plastic film restricted, while no such restriction applies to other textile products made from plastic or rubber?\n\nThe GST Council had already decided in its 52nd meeting to restrict refunds on imitation zari made from metallised plastic film. The current exercise is only to simplify and streamline GST rates, so that earlier decision continues.",
    "scraped_at": "2025-10-09T08:21:38.480193+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/market/trade-setup-october-9-nifty-50-key-levels-banks-it-stocks-tcs-tata-elxsi-q2-results-share-price-19708438.htm",
    "title": "Trade Setup for October 9: 25,000 holds the key for Nifty as TCS begins Q2 results season",
    "content": "HomeMarket NewsTrade Setup for October 9: 25,000 holds the key for Nifty as TCS begins Q2 results seasonThe only positive, if any, is the fact that the Nifty managed to defend 25,000 yet again. That now becomes the crucial level to watch out for going into the BSE weekly contracts expiry session.If one can pick up Tuesday's trading session and put it in a xerox machine, the outcome will be what happened with the Nifty on Wednesday.\n\nA scene-by-scene copy is what transpired with the Nifty on Wednesday with the index opening higher, surging to the day's high in the first few minutes of the trading session, the recovery gets sold into, the dip gets bought, and the subsequent recovery also gets sold into, and the index ends near the lowest point of the day.\n\nThe Nifty bulls have the underperforming IT stocks to thank for ensuring that the downside was capped on Wednesday. Every constituent of the Nifty IT index ended with gains in mid-week trading, including TCS, which continued its rebound from the 52-week low it fell to on October 1.\nTwo things that the bulls will not like from Wednesday's session, apart from the fact that there is profit booking emerging at higher levels. First, the streak of higher highs and higher lows was broken on Wednesday with the Nifty making a lower high, as well as a lower low. The second bit being that for the second day in a row, the index has closed near the lowest point of the day, and significantly below the intraday high.\nThe only positive, if any, is the fact that the Nifty managed to defend 25,000 yet again. That now becomes the crucial level to watch out for going into the BSE weekly contracts expiry session. Before aiming for Tuesday's swing high of 25,220, the Nifty now will have to cross the 25,150 - 25,200 zone, which is where the resistance emerged fro on Wednesday.\n\nThe Nifty Bank also made a lower high and a lower low on Wednesday, and somehow managed to stay above the mark of 56,000 towards the close of trade. The index is now down 500 points from the recent swing high of 56,502 and also snapped a six-day winning streak. For the banking index, the 56,300 mark becomes the first important level on the upside to watch, while the 56,000 - 55,800 zone now on the downside will be an area where the index could look for support.\n\n\"Although the medium-term outlook remains steady, the combination of an extended rally and rejection from the upper band points to a potential cooling-off phase in the coming sessions,\" Om Mehra of SAMCO Securities said. \"The support is seen near 55,650, followed by 55,500, whereas resistance is placed at 56,300–56,400,\" he added.\n\nEarnings season begins in full earnest from Thursday, with India's largest IT services company TCS kickstarting proceedings for the Nifty 50 companies. Along with TCS, Tata Elxsi and GM Breweries will also be reporting their results.\n\nNagaraj Shetti of HDFC Securities believes that the near-term Nifty uptrend remains intact and that the present consolidation would be completed around the 25,000 - 24,900 levels. 25,200 on the upside is a key overhead resistance.\n\nAs long as the Nifty trades below the 25,150 mark, the weakness may persist on the index and may extend to levels of 25,000 - 24,950 levels, Shrikant Chouhan of Kotak Securities said, adding that a break below 24,950 can even drag the index lower to 24,850 levels. On the other hand, a move above 25,150 can take the index back to 25,250 - 25,300 levels. \"The intraday market texture is non-directional and volatile; hence, level-based trading would be an ideal strategy for day traders,\" he said.",
    "scraped_at": "2025-10-09T08:21:38.80594+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/market/rbl-bank-sbi-cards-share-price-rbi-draft-norms-credit-risk-capital-framework-impact-aum-transactor-19707720.htm",
    "title": "Explained - How RBL Bank and SBI Cards benefit from the RBI draft circular for credit risk capital framework",
    "content": "HomeMarket NewsExplained - How RBL Bank and SBI Cards benefit from the RBI draft circular for credit risk capital frameworkAs per the draft norms, for personal loans and credit cards, the risk weight will continue with a 125% limit. However, for the \"transactor\" category of credit cards, the risk weight is proposed to be brought down to 100% from 125%.Shares of SBI Cards \u0026 Payment Services Ltd. and RBL Bank Ltd. surged up to 5% on Wednesday, October 8 in response to the Reserve Bank of India's draft guidelines for the credit risk capital framework, which were released on Tuesday evening.\n\nAs per the draft norms, for personal loans and credit cards, the risk weight will continue with a 125% limit. However, for the \"transactor\" category of credit cards, the risk weight is proposed to be brought down to 100% from 125%.\n\nA transactor credit card user is one who consistently pays their credit card balance in full by the due date of each month, thereby avoiding both interest charges and late fees. In contrast, a revolver is one who carries a balance and incurs interest.\n40% of SBI Cards total receivables of ₹56,607 crore are \"transactor\" users.\n\nAccording to Macquarie, the move is positive for SBI Cards, as it will release 450 basis points worth of capital for the company.\n\nMotilal Oswal also wrote in its note that the move is positive for credit card players, as most of them have a higher \"transactor\" base, which ranges between 55% to 65% of the overall receivables.\n\nThe move is also positive for RBL Bank as nearly 18% of its overall loan book is from the credit card segment, and out of its total assets under management (AUM) of ₹21,499 crore as of the June quarter, 30% is from \"transactors.\"\n\nShares of RBL Bank ended 4.9% higher at ₹287. The stock is still in the F\u0026O ban, which means no new positions can be created on the stock. On the flip side, shares of SBI Cards ended marginally off the highs of the day, but with gains of 1.8% at ₹921.3.",
    "scraped_at": "2025-10-09T08:21:38.953726+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/technology/telecom/axis-capital-bharti-airtel-indus-towers-vodafone-idea-alpha-article-19706686.htm",
    "title": "Gaurav Malhotra of Axis Capital positive on Bharti Airtel, prefers Indus Towers over Vodafone Idea",
    "content": "HomeTechnology NewsTelecom NewsGaurav Malhotra of Axis Capital positive on Bharti Airtel, prefers Indus Towers over Vodafone IdeaGaurav Malhotra, Executive Director at Axis Capital, advises a reduce on Vodafone Idea due to its AGR issues and weak financials, suggesting Indus Towers as a safer add-rated alternative with attractive valuations.Sharing a cautious but strategic outlook on the Indian telecom sector, Gaurav Malhotra, Executive Director at Axis Capital, expressed a positive view on Bharti Airtel while advising investors to be wary of Vodafone Idea's challenges. He also suggests that Indus Towers may offer a more stable way to gain exposure to the sector's dynamics.\n\nOn Vodafone Idea, Malhotra confirmed that Axis Capital's published view is a 'reduce' rating. He cited several well-known headwinds facing the company, including uncertainties surrounding the adjusted gross revenue (AGR) issue, a precarious cash flow situation, and the failure to raise necessary debt funding more than a year and a half after its equity fundraise. \"There are just too many imponderables around the AGR issue, the cash flow situation, etc.,\" he said, cautioning against getting carried away by intermittent positive news flow, which tends to be temporary.\n\nAs an alternative, Malhotra suggested Indus Towers, on which the firm has an 'add' rating. He described it as a \"lower beta play on what happens with Vodafone.\" The rationale is twofold: the valuation is supportive and already reflects the uncertainties surrounding Vodafone Idea, and the stock is attractive from a free cash flow (FCF) yield perspective. This makes it a potentially safer investment for those wanting to bet on the sector's stability.\n\n\n\nRegarding Bharti Airtel, Malhotra expressed a 'quite positive' stance. He highlighted strong earnings visibility for the next two to three years, driven by a confluence of factors including tariff hikes, premiumisation of its customer base, and growing traction in its fixed wireless access (FWA) services. While acknowledging that valuations are not cheap compared to historical or global peers, he believes they are justified by robust earnings visibility and increasing free cash flow generation, which should lead to higher dividend payouts.\n\nAlso Read: Jio gains 19.5 lakh users in August; Airtel steady, Vodafone Idea loses more\n\nMalhotra also downplayed the significance of transient subscriber data, stating that the more critical metric for Bharti is the organic upgradation of its existing 2G subscribers to 4G. To track this premiumisation trend, he advised investors to monitor metrics like rising data consumption per user, growth in the proportion of post-paid subscribers, and updates on its converged offering, Airtel Black.\n\nAlso Read: No FMCG in portfolio; prefer telecom, housing and credit as consumption plays: Sohum AMC\n\nOn Jio, he stated that its financial performance is expected to be largely similar to Bharti's.\n\n\n\nFor the entire interview, watch the accompanying video\n\nCatch all the latest updates from the stock market hereNote To ReadersReliance Industries Ltd, which owns Jio, is the sole beneficiary of Independent Media Trust that controls Network18, the parent company of CNBCTV18.com.(Edited by : Unnikrishnan)",
    "scraped_at": "2025-10-09T08:21:39.096475+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/market/tcs-share-price-rebound-from-52-week-low-ahead-of-q2-results-revenue-margin-deals-outlook-19706621.htm",
    "title": "TCS shares continue rebound from 52-week low ahead of Q2 results; Here's what to expect",
    "content": "HomeMarket NewsTCS shares continue rebound from 52-week low ahead of Q2 results; Here's what to expectTCS has reported negative constant currency revenue growth for two quarters in a row. During the June quarter, constant currency revenue growth for TCS was a negative 3.3%.Shares of Tata Consultancy Services (TCS) Ltd. are trading with gains of over 2% on Wednesday, October 8, a day prior reporting its results for the July-September period.\n\nThe stock has gained in two out of the three trading sessions so far this week, and are up 4% during this period. Shares of the largest listed Tata Group entity are rebounding from their 52-week low of ₹2,866, which they fell to on October 1 this year.\n\nAccording to a CNBC-TV18 poll, TCS is likely report a 0.4% growth in its US Dollar Revenue when compared to the June quarter.\nIn rupee terms, the growth is likely to be 2.6% when compared to the June quarter.MetricFigureGrowth (QoQ)Revenue ($M)7,447.40.4%Revenue (₹ Cr)65,1142.6%EBIT (₹ Cr)16,1033.8%EBIT Margin (%)24.720 basis pointsNet Profit (₹ Cr)12,528.3-1.4%\nTCS is likely to report revenue growth of 0.2% sequentially in constant currency terms. Brokerages have a wide range of estimates, while Morgan Stanley expects a negative 0.2% growth, Nomura is projecting that number to be a negative 0.5%. TCS has reported negative constant currency revenue growth for two quarters in a row. During the June quarter, constant currency revenue growth for TCS was a negative 3.3%.\n\nEBIT margins are likely to remain stable despite the impact of wage revision from September 1, which will be offset by the weakness in the rupee. Deal wins are likely to remain stable, as the company had announced a mega $550 million deal with Scandinavian non-life insurer Tryg.\n\nInvestors this quarter will focus on:\n \t12,000 employees laid-off, the impact on morale, costs associated with it.\n \tH 1-B dependence and the plans for further de-risking\n \tImplications from the JLR cyberattack incident\n \tPace of GenAI adoption and deflationary impact on spends\n \tUpdates on second phase of the BSNL deal\n\nShares of TCS are trading 1.9% higher at ₹3,031. The stock has recovered its losses over the last one month.First Published: Oct 8, 2025 10:18 AM IST",
    "scraped_at": "2025-10-09T08:21:39.245579+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/market/it-sector-weight-falls-below-hdfc-bank-19706407.htm",
    "title": "Five IT majors together have lower weight than HDFC Bank in Nifty50",
    "content": "HomeMarket NewsFive IT majors together have lower weight than HDFC Bank in Nifty50The combined influence of India’s top IT companies in the Nifty50 has slipped below that of HDFC Bank as sector shares continue to slide. While HDFC Bank’s weight now stands at 13.02%, the five IT majors together account for just 9.9%, reflecting significant underperformance amid earnings pressures and global headwinds. Meanwhile, financial and energy stocks have boosted the index, offsetting the drag from IT.The extended decline in shares of India’s top IT companies has sharply reduced their influence in the benchmark Nifty50 index. The five sector heavyweights — Infosys, Tata Consultancy Services (TCS), HCL Technologies, Tech Mahindra, and Wipro — have collectively fallen around 25% so far this year, dragging their combined weight in the Nifty50 down to 9.9%.Continue Reading with CNBC-TV18 Access MembershipPriority Access and Networking: CNBC-TV18's flagship events Interaction with CNBC-TV18's journalists Webinars \u0026 LIVE Q\u0026As with India Inc. Leaders Exclusive CNBC-TV18 studio \u0026 newsroom tours Premium business insights, expert opinions \u0026 analysis Curated lifestyle privileges \u0026 offers",
    "scraped_at": "2025-10-09T08:21:39.394025+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/photos/market/sbi-securities-diwali-picks-hdfc-bank-share-price-target-tvs-motor-ashok-leyland-nsdl-19706025.htm",
    "title": "Diwali Stock Picks: SBI Securities names 15 shares for up to 25% upside",
    "content": "SBI Securities has listed 15 stocks poised for festive-season gains, projecting up to 25% upside across banking, auto, metal, and consumer sectors. Here’s the full lineup of potential outperformers this Diwali.1 / 15HDFC Bank- Target ₹1,110; Upside 14% | SBI Securities expects HDFC Bank to rebound strongly, projecting loan growth of 10% in FY26 and 13% in FY27. Robust deposit growth and a balanced funding mix are set to fuel its next expansion phase.2 / 15TVS Motor- Target ₹3,975; Upside 13.2% | TVS Motor is positioned to benefit from rural recovery and export strength. The brokerage cites GST 2.0 and capacity leverage as key margin drivers through FY26–27.3 / 15Apollo Hospitals- Target ₹8,675; Upside 13.2% | Apollo Hospitals’ earnings visibility remains strong, backed by higher occupancy, digital expansion, and asset-light growth. SBI Securities maintains a positive long-term outlook.4 / 15Indian Bank- Target ₹875; Upside 15.4% | Indian Bank is expected to post steady growth across NII, PPOP, and PAT, each clocking around 10% CAGR. The stock trades attractively at 1.1x FY27 book value, the brokerage said.5 / 15Ashok Leyland- Target ₹170; Upside 23.2% | SBI Securities sees margin improvement at Ashok Leyland, led by lower input costs, favorable mix, and pricing discipline. The stock trades at 20.5x FY27 earnings, offering solid upside potential.6 / 15Jubilant FoodWorks- Target ₹720; Upside 15.5% | The brokerage expects GST rationalisation to boost consumption and QSR demand. Lower input costs and stronger same-store sales could enhance growth momentum for Jubilant FoodWorks.7 / 15NALCO- Target ₹260; Upside 19.7% | SBI Securities sees operational efficiency and production growth driving NALCO’s performance. The stock trades at 6.1x FY27 EV/EBITDA, with strong demand recovery prospects.8 / 15NSDL- Target ₹1,380; Upside 15.2% | NSDL is seen as a proxy play on market revival, with revenue and PAT projected to grow at 5% and 14% CAGR through FY27, according to SBI Securities.9 / 15Azad Engineering- Target ₹2,105; Upside 22.5% | SBI Securities expects Azad Engineering to deliver 42.7% PAT CAGR through FY27. The company’s strong order book and growth in aerospace and energy components underpin optimism.10 / 15Oswal Pumps-Target ₹970; Upside 25.2% | Oswal Pumps is projected to post over 30% CAGR in revenue and profit till FY27. Strong expansion plans and operating efficiency support the highest upside potential in the list.11 / 15Subros Ltd- Target ₹1,355; Upside 21.2% | Subros is expected to gain from the PV/CV industry upcycle and GST cuts, driving higher volumes. Supportive monetary policy adds further tailwinds.12 / 15Indian Metals \u0026 Ferro Alloys- Target ₹1,415; Upside 21.7% | IMFA aims to ramp up ferrochrome production under its Kalinganagar expansion. The stock trades at a modest 12x FY27 P/E, with steady growth visibility.13 / 15Fiem Industries- Target ₹2,340; Upside 22.5% | Fiem Industries is set to benefit from the two-wheeler recovery and LED lighting transition. Entry into the PV segment offers additional growth drivers.14 / 15Swaraj Engines- Target ₹5,112; Upside 24.2% | GST cuts on tractors are expected to spur replacement demand. With a dividend yield of 3% and high payout ratio, Swaraj Engines offers both growth and income appeal.15 / 15Pondy Oxides \u0026 Chemicals- Target ₹1,530; Upside 23.4% | POCL’s diversified recycling business and upcoming Phase-2 expansion support strong growth. Entry into lithium-ion recycling aligns with its 20%+ CAGR Vision 2030.",
    "scraped_at": "2025-10-09T08:21:39.550056+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/market/stocks-end-higher-for-fourth-straight-day-led-by-gains-in-reliance-rail-stocks-19705647.htm",
    "title": "Stocks end higher for fourth straight day led by gains in Reliance, rail stocks",
    "content": "HomeMarket NewsStocks end higher for fourth straight day led by gains in Reliance, rail stocksThe NSE Nifty 50 rose 31 points, or 0.12%, to 25,108, while the S\u0026P BSE Sensex gained 137 points, or 0.17%, to close at 81,927. Despite the upmove, market breadth favoured declines, with mid- and small-cap stocks showing mixed trends. The Nifty Midcap 100 climbed 274 points to 58,289.The stock market closed higher on Tuesday, extending gains for a fourth straight session, though profit-taking in select banking and consumer stocks capped broader market advances.\n\nThe NSE Nifty 50 rose 31 points, or 0.12%, to 25,108, while the S\u0026P BSE Sensex gained 137 points, or 0.17%, to close at 81,927. Despite the upmove, market breadth favoured declines, with mid- and small-cap stocks showing mixed trends. The Nifty Midcap 100 climbed 274 points to 58,289.\n\n\n\n\n\n\n\n\n\n\n“The markets are trying to hold the critical support at 24,440-24,337 and they've come back to about 25,200. The markets are facing very important headwinds in the form of macro headwinds. While Reliance is showing some positive signs, I don't know if the local factors will trump over the global macro. So, I suspect the global macro will win over the local factors,” said Jai Bala, a Certified Financial Technician at Cashthechaos.com.\n\n\n\n\n\n\n\n\n\n\n\n\nBanking and energy shares provided most of the support. The Nifty Bank index rose 135 points to 56,239, led by gains in ICICI Bank and SBI, even as Axis Bank and Kotak Mahindra Bank saw profit booking. Reliance Industries added nearly 1%, extending its recent momentum and contributing the most to Nifty’s upside.\nAmong sectoral movers, telecom and rail stocks outperformed. Vodafone Idea jumped nearly 9% after positive developments in the adjusted gross revenue (AGR) case, while Bharti Airtel rose 1% on signs of improved subscriber additions. Indus Towers also advanced.\n\nRailway-linked stocks surged after the Cabinet cleared projects worth ₹24,000 crore. IRCON International rallied 7%, while Titagarh Rail Systems gained over 4%.\n\nIndraprastha Gas Ltd (IGL) surged 6% following reports of a potential change in the tax framework for gas sourcing. Dreamfolks Services rose 5% after announcing its entry into the B2C segment.\n\nOn the downside, Tata Motors fell 2% despite its Jaguar Land Rover unit resuming production at one plant. Trent slipped 2% after reporting subdued Q2 growth. Life insurance stocks ended mixed — HDFC Life and Max Financial declined, while SBI Life gained.\n\nIn the midcap segment, Divi’s Laboratories, Titagarh Rail, Torrent Power, Amber Enterprises, and Federal Bank were among the top gainers, whereas CESC, Jindal Steel and Power, Britannia, HDFC Asset Management, Bank of Baroda, and Hindustan Copper were the top laggards.First Published: Oct 7, 2025 3:38 PM IST",
    "scraped_at": "2025-10-09T08:21:39.697197+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/market/hdfc-amc-share-price-citi-valuations-rich-stock-returns-52-week-high-profit-priorities-19704836.htm",
    "title": "HDFC AMC shares have more downside in store as valuations are 'rich'; Citi remains cautious",
    "content": "HomeMarket NewsHDFC AMC shares have more downside in store as valuations are 'rich'; Citi remains cautiousCiti said it is enthused by the managment's increasing focus on non-mutual funds. However, the current richness of the stock, at 36 times its financial year 2027 estimated earnings per share (EPS), drives the brokerage's guarded stance.\n\nThe 50% rally seen in shares of HDFC AMC Ltd. over the last six months, has positioned the stock for some downside, Citi wrote in its note, expressing its cautious stance.\n\nCiti reiterated its \"sell\" rating on HDFC AMC with a price target of ₹4,775 per share, which implies a potential downside of 17% from Monday's close.\nThe brokerage recently held a meeting with the company's top management in Singapore, where they discussed HDFC AMC's focus on scaling its non-mutual fund business, control expenses, and managing profitability.\n\n\nHDFC AMC's management intends to scale up its market presence in the alternate space backed by sustained new product launches. However, it intends to scale up in a guarded manner while retaining its investment discipline, Citi's note said.\n\nThe management spoke about product innovation, investment discipline and graded approach as key levers to achieve market leadership in non-mutual fund segments over the next decade, according to the note.\n\nHDFC AMC's management also remained constructive on structural growth in equity MF flows aided by steady and sticky recurring SIP flows, albeit acknowledging near-term volatility in flows in an environment of sustained sluggishness in listed equities, Citi said.\n\n\nWhile the execution risks remain, Citi said it is enthused by the managment's increasing focus on non-mutual funds. However, the current richness of the stock, at 36 times its financial year 2027 estimated earnings per share (EPS), drives the brokerage's guarded stance.\n\nOf the 28 analysts that have coverage on the HDFC AMC stock, 19 have a \"buy\" rating, eight have a \"hold\" rating and one has a \"sell\" rating.\n\nHDFC AMC shares were down 0.9% at ₹5,608.5 apiece around 10.40 am on Tuesday. The stock has gained 50.3% in the past six months.\n\nAlso Read: Delhivery shares rise for third day as Macquarie projects 17% upside, Kotak upgrades",
    "scraped_at": "2025-10-09T08:21:39.874962+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/market/kalyan-jewellers-share-price-icici-securities-upgrade-target-upside-valuation-q2-update-growth-19703773.htm",
    "title": "Kalyan Jewellers shares can rise 50% — ICICI Securities upgrades stock to 'buy'",
    "content": "HomeMarket NewsKalyan Jewellers shares can rise 50% — ICICI Securities upgrades stock to 'buy'ICICI Securities wrote in its note that a 35% correction in the stock price of Kalyan Jewellers last year has provided a margin of safety, thereby leading to their upgrade.Shares of Kalyan Jewellers India Ltd. can rise up to 50% as per brokerage firm ICICI Securities' note from Monday, October 6.\n\nThe brokerage has upgraded its rating on the stock to \"buy\" from \"add\", but has left its price target unchanged at ₹670 per share.\n\nICICI Securities wrote in its note that a 35% correction in the stock price last year has provided a margin of safety, thereby leading to their upgrade.\nIt has maintained its earnings estimate for the company and expects it to deliver strong same store sales growth (SSSG) in the financial year 2026, supported by strong festive and wedding-led demand.\nICICI Securities reiterated its positive stance on the stock as it believes it may continue to outperform its peers on the back of:\n \tAggressive store expansion through its asset-light franchise owned, company operated (FOCO) model.\n \tAdding growth levers from omni-channel format Candere.\n \tImproving balance sheet health through further debt reduction between ₹350 crore to ₹400 crore in the current financial year.\n\nWith steady demand trends despite elevated gold prices, coupled with an accelerating store rollout, ICICI Securities said it expects Kalyan Jewellers' revenue momentum to remain strong going ahead.\n\nKalyan Jewellers reported its provisional numbers for the second quarter on Monday. It expects consolidated revenue growth of around 30% in the September quarter.\n\nOf the 10 analysts that have coverage on the stock, eight have a \"buy\" rating and one each have a \"hold\" and \"sell\" rating.\n\nShares of Kalyan Jewellers were trading 1.6% lower at ₹484.25 apiece around 2.50 pm. The stock has declined 37.8% this year, so far.\n\nAlso Read: Here's why Premier Explosives shares are up 10% on Monday",
    "scraped_at": "2025-10-09T08:21:40.032714+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/photos/market/stocks/stocks-to-watch-ltimindtree-brigade-enterprises-bharti-airtel-vodafone-idea-and-more-19704603.htm",
    "title": "Stocks to Watch: LTIMindtree, Brigade Enterprises, Bharti Airtel, Vodafone Idea and more",
    "content": "Stocks to watch, LTIMindtree, Brigade Enterprises, Bharti Airtel, Vodafone Idea, Dilip Buildcon, HCLTech, Zydus Lifesciences, Metropolis Healthcare, Bank of India and more, these are the stocks to watch for tomorrow.1 / 8LTIMindtree | IT solutions provider said it has announced a multi-year agreement with a leading global media and entertainment company, marking the company’s largest strategic deal to date. The deal builds on a long-standing partnership between the two companies. Under this agreement, LTIMindtree will support the client’s digital transformation initiatives aimed at streamlining operations and modernising delivery models.2 / 8Brigade Enterprises | Real estate major has entered into a joint development agreement (JDA) for a 6.6-acre land parcel in West Chennai, marking another strategic expansion in one of its key markets. The premium residential project carries an estimated gross development value (GDV) of ₹1,000 crore and is positioned along a major arterial corridor offering connectivity to Chennai’s industrial and business districts.3 / 8Bharti Airtel, Vodafone Idea | India’s telecom subscriber base grew modestly in August 2025, with Reliance Jio leading additions, according to data from the Telecom Regulatory Authority of India (TRAI). Jio added 19.5 lakh users during the month, sharply higher than the 4.83 lakh added in July. Bharti Airtel’s user base grew by 4.96 lakh, marginally up from 4.94 lakh in July, while Vodafone Idea continued to lose customers, shedding 3.1 lakh subscribers compared to 3.5 lakh the previous month.4 / 8Dilip Buildcon | Infrastructure firm said the company, through its joint venture DBL-APMPL (DBL 74% and APMPL 26%), has received a Letter of Acceptance (LOA) for developing a 100 MW grid-connected ground-mounted solar photovoltaic (PV) power project under captive mode. The project involves supplying power to Madhya Pradesh Jal Nigam (MPJNM) for a period of 25 years from the date of commissioning. The project, awarded by MPJNM, is domestic in nature and will be developed under a general contract.5 / 8HCLTech | IT services firm said it has joined the MIT Media Lab, a globally recognised research and innovation ecosystem at the Massachusetts Institute of Technology (MIT), to collaborate on next-generation artificial intelligence (AI) research. The partnership marks a significant step in HCLTech’s commitment to shaping the future of AI and driving breakthroughs in emerging technology domains, including quantum computing, through collaborative innovation.6 / 8Zydus Lifesciences | The company said on Monday it has received a Notice of Compliance (NOC) from Health Canada for its generic Liothyronine tablets in 5 mcg and 25 mcg strengths. Liothyronine, a synthetic form of the thyroid hormone T3 (triiodothyronine), is primarily used to treat hypothyroidism. The tablets will be manufactured at Zydus’ Ahmedabad SEZ facility. The product had annual sales of 10.9 million Canadian dollars in Canada, according to IQVIA MAT data for June 2025.7 / 8Metropolis Healthcare | The company recorded a 23% year-on-year consolidated revenue growth for Q2FY26, driven by preventive health check-ups and wellness services. Core Diagnostics moved from breakeven in Q4FY25 to a high single-digit margin in Q2FY26. DAPIC (Dehradun) and Scientific Pathology (Agra) outperformed the company’s average margin. TruHealth Wellness and Specialty segments grew 25% and 36% year-on-year, respectively. B2C revenues rose 16%, while B2B revenues increased 34%. The company remains debt-free with a net cash surplus of ₹55 crore.8 / 8Bank of India | State-owned bank reported a year-on-year growth of 11.8% in its global business, which rose to ₹15,61,888 crore as of September 30, 2025, from ₹13,97,100 crore a year earlier, according to the bank’s provisional financial results for the second quarter of FY26. Global deposits grew 10.08% year-on-year to ₹8,53,301 crore from ₹7,75,181 crore a year earlier, while global gross advances rose 13.94% to ₹7,08,587 crore from ₹6,21,919 crore.",
    "scraped_at": "2025-10-09T08:21:40.228691+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/market/bharti-airtel-share-price-multi-year-contract-indian-railways-it-protection-ecosystem-cybersecurity-size-scope-19703504.htm",
    "title": "Bharti Airtel wins multi-year contract from Indian Railways for IT protection ecosystem",
    "content": "HomeMarket NewsBharti Airtel wins multi-year contract from Indian Railways for IT protection ecosystemAirtel will design, build, implement and operate a greenfield, multi-layered, cybersecurity 24x7 365-day protection ecosystem that will serve as a resilient defence barrier to safeguard the Indian Railways' IT backbone, while ensuring uninterrupted, secure and seamless digital operation.Bharti Airtel Ltd. on Monday, October 6, said its Airtel business has secured a multi-year contract from Indian Railway Security Operations Centre.\n\nIt said it Airtel will design, build, implement and operate a greenfield, multi-layered, cybersecurity 24X7, 365-day protection ecosystem that will serve as a resilient defence barrier to safeguard the Indian Railways' IT backbone, while ensuring uninterrupted, secure and seamless digital operation.\n\nIt added more than 1 billion Indians will benefit from the enhanced data security for seamless ticket booking, payments, train tracking and more.\n\"Our robust security layer will advance security efficiency in ticketing and data management, shield all railway digital operations from evolving cyber threats while delivering safe and seamless digital services to millions of daily railway commuters,\" Sharat Sinha, the CEO and director of Airtel Business, said.\n\nDilip Kumar, EDIP — Railway Board, said the establishment of IRSOC will help provide a centralised security operations centre to continuously monitor Indian Railways assets, detect and respond to cyber security threats efficiently, gather threat intelligence an ensure proper collaboration with National Cyber Security Agencies.\n\nShares of Bharti Airtel were trading 0.2% up at ₹1,899.8 apiece around 12.20 pm. The stock has gained 19.1% this year, so far.\n\nAlso Read: Vodafone Idea shares decline up to 5% as SC adjourns AGR plea hearing to October 13",
    "scraped_at": "2025-10-09T08:21:40.394975+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/market/stock-market-live-updates-sensex-nifty-50-today-q2-updates-vodafone-idea-banks-marico-tata-capital-ipo-share-price-liveblog-19703037.htm",
    "title": "Sensex Today | Stock Market Highlights: Nifty reclaims 25,000 as IT, financials and Reliance lead gains",
    "content": "HomeMarket NewsSensex Today | Stock Market Highlights: Nifty reclaims 25,000 as IT, financials and Reliance lead gainsSensex Today | Stock Market LIVE Updates: The equity benchmarks extended gains for the third consecutive session on Monday (October 6), led by strength in financials, IT, and Reliance Industries. The Nifty 50 reclaimed the 25,000 mark, rising 183 points to close at 25,078, while the Sensex advanced 583 points to settle at 81,790.Sensex Today | Stock Market LIVE Updates: The equity benchmarks extended gains for the third consecutive session on Monday (October 6), led by strength in financials, IT, and Reliance Industries. The Nifty 50 reclaimed the 25,000 mark, rising 183 points to close at 25,078, while the Sensex advanced 583 points to settle at 81,790.\n\nThe broader market, however, showed mixed trends with the NSE advance-decline ratio at 3:4, indicating more stocks ended lower despite the headline indices finishing in the green. The Nifty Bank gained 516 points to 56,105, while the Nifty Midcap Index rose 512 points to 58,015.\n\nIT stocks led the rally ahead of the earnings season, with the Nifty IT index climbing 2%, emerging as the top sectoral gainer. Hospital stocks surged after the government revised CGHS package rates, sending Max Healthcare and Fortis Healthcare up 7% each.",
    "scraped_at": "2025-10-09T08:21:41.33467+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/photos/market/stocks-to-watch-banking-sector-infosys-vodafone-idea-lupin-and-more-19702077.htm",
    "title": "Stocks to Watch: Banking sector, Infosys, Vodafone Idea, Lupin and more",
    "content": "Key financial and corporate updates are in focus with HDFC Bank, Kotak Mahindra Bank, PNB, and AU Small Finance Bank posted healthy Q2 business growth, while Bajaj Finance added over 4 million new customers. Vedanta and Hindustan Zinc reported record production, and Infosys announced a new partnership with Telenor. Meanwhile, Lupin faced regulatory headwinds, Vodafone Idea named a new CFO, and Bansal Wire reported a minor fire incident. Here are few stocks to watch ahead of Monday's trading session.1 / 18HDFC Bank | HDFC Bank's gross advances increased 4.4% sequentially from ₹26.53 lakh crore and 9.9% from the previous year's ₹25.19 lakh crore to ₹27.69 lakh crore in the September quarter this fiscal. Its deposits average of ₹27.1 lakh crore increased 15.1% from last year's ₹23.54 lakh crore and was up 2% sequentially from ₹26.57 lakh crore.2 / 18Bajaj Finance | At the end of September 30, Bajaj Finance's customer franchise stood at 110.64 million, compared to 92.09 million in the year-ago period. In the second quarter, its customer franchise increased by 4.13 million. Bajaj Finance's new loans booked were up 26% to 12.17 million compared to 9.69 million last year..3 / 18Vedanta | The company achieved its highest-ever quarterly and half-yearly alumina production at the Lanjigarh refinery, with output up 31% year-on-year (YoY), at 653 kt. Aluminium production also hit a record at 617 kt, up 1% year-o4 / 18Kotak Mahindra Bank | The lender reported a 15.8% year-on-year rise in period-end net advances, which stood at ₹4.62 lakh crore as of September 30, 2025. Sequentially, net advances were up 4%. The bank’s average net advances for the quarter grew 14.6% year-on-year and 4% quarter-on-quarter to ₹4.47 lakh crore.5 / 18Punjab National Bank | PNB reported provisional Q2 FY26 business of ₹27.88 lakh crore, up 10.6% YoY. Domestic business rose 10.4% YoY to ₹26.83 lakh crore, reflecting steady growth.6 / 18Infosys | The IT major has partnered with Telenor Shared Services to modernize HR operations using Oracle Cloud HCM. The collaboration aims to standardise processes, boost employee productivity, and enhance decision-making through unified digital systems.7 / 18Marico Ltd | The company expects Q2 FY26 consolidated revenue to grow in the “thirties” percent YoY, driven by strong international performance and GST benefits in India, with modest growth projected in operating profit. Last year, Q2 revenue rose 7.6% to ₹2,664 crore, and net profit jumped 20.3% to ₹433 crore.8 / 18YES Bank | The company reported provisional Q2 FY26 figures, with loans and advances at ₹2,50,468 crore (up 6.5% YoY) and deposits at ₹2,96,831 crore (up 7.1% YoY). Certificate of Deposits stood at ₹987 crore.9 / 18Avenue Supermarts | The operator of D-Mart, reported standalone Q2 FY26 revenue of ₹16,218.79 crore, up from ₹14,050.32 crore a year ago. The retailer operated 432 stores as of September 30, 2025, with one Navi Mumbai outlet under reconstruction.10 / 18Vodafone Idea | The network operator giant has appointed Tejas Mehta as Chief Financial Officer, from October 6, 2025, succeeding Murthy Gvas.11 / 18Lupin | Lupin said the US drug regulator has classified its inspection of the Pithampur Unit 2 manufacturing facility as 'official action indicated' (OAI). The US Food and Drug Administration (USFDA) had conducted inspections at the facility from July 8 to July 17, 2025, and closed it by issuing Form 483 with four observations. The Mumbai-based pharma major also launched Liraglutide Injection in US to help adults and children with type 2 diabetes manage their blood sugar levels12 / 18Hindustan Zinc | The company posted a mixed Q2 FY26 update with mined metal output at 258 kt (up 1% YoY, down 3% QoQ). Refined zinc rose 2% YoY to 202 kt, while refined lead dropped 29% YoY to 45 kt.13 / 18UCO Bank | reported a total business of ₹5.37 lakh crore for the quarter ended September 30, 2025, reflecting a 13.29% year-on-year (YoY) growth and a 2.48% quarter-on-quarter (QoQ) increase. Total advances rose 16.67% YoY to ₹2.31 lakh crore, with domestic advances increasing 17.24% YoY to ₹2.04 lakh crore. Total deposits reached ₹3.06 lakh crore, up 10.87% YoY and 2.34% QoQ, while domestic deposits grew 9.85% YoY to ₹2.90 lakh crore..14 / 18Equitas SFB | The lender reported a 5.93% year-on-year (YoY) growth in total deposits, reaching ₹22,894 crore as of September 30, 2025. CASA deposits rose 13.67% YoY to ₹6,046 crore during the same period. The CASA ratio improved to 26.41% as of September 30, 2025, compared with 24.61% a year earlier.15 / 18AU Small Finance Bank | The lender's total deposits increased 20.8% from ₹1.09 lakh crore and 3.8% sequentially from ₹1.27 lakh crore to ₹1.32 lakh crore in the September quarter. Its gross advances were up 22.4% from ₹96,033 crore last year to ₹1.17 lakh crore in the second quarter this fiscal. It increased 5.3% sequentially from ₹1.11 lakh crore16 / 18Sobha | The Bengaluru-based real estate developer reported a total sales value of ₹1,902.6 crore for the second quarter of FY26, a 61.4% year-on-year increase, though down 8.5% sequentially from the previous quarter.17 / 18RBL Bank | The bank reported Q2 FY26 deposits of ₹1,16,665 crore, up 8% YoY, with deposits below ₹3 crore at ₹59,441 crore (51% of total). CASA rose 3% YoY to ₹37,169 crore, while the CASA ratio fell to 31.9%; liquidity coverage averaged 127%.18 / 18Bansal Wire Industries | The company reported a fire at its plant on NTPC Road in Gautam Buddh Nagar, which caused a temporary disruption of operations at C Shed. The company confirmed that no injuries or fatalities were reported.",
    "scraped_at": "2025-10-09T08:21:41.55202+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/market/banks-gain-competitive-edge-over-nbfcs-after-rbi-measures-says-icici-prudentials-anish-tawakley-19702520.htm",
    "title": "Banks gain competitive edge over NBFCs after RBI measures, says ICICI Prudential’s Anish Tawakley",
    "content": "HomeMarket NewsBanks gain competitive edge over NBFCs after RBI measures, says ICICI Prudential’s Anish TawakleyAnish Tawakley of ICICI Prudential AMC says tech and metals face headwinds, while cyclicals like industrials and capital goods are preferred.RBI’s recent monetary and regulatory measures are set to reshape the competitive landscape between banks and non-banking financial companies (NBFCs).\n\nAccording to Anish Tawakley, Co-CIO Equity at ICICI Prudential AMC, “Overall, if you take them in aggregate, they do free up the banks to undertake more activities and those activities were otherwise being undertaken exclusively by NBFCs or by less regulated entities.” This expansion in operational boundaries strengthens banks’ position, allowing them to raise deposits and enter previously NBFC-dominated segments, which could translate into higher profitability for lenders.\n\nTawakley highlighted that sectors most sensitive to economic cycles—industrials, capital goods, banks, and autos—are likely to benefit first as recovery gathers pace. While cement and auto companies have already seen some gains, he sees more potential in industrials and capital goods for the near term.\nThe housing sector remains central to India’s growth story. Although sales have slowed in recent months, incentives and price adjustments by developers are expected to revive activity. Housing drives demand for construction materials, labour, and services, making it a critical barometer for broader economic recovery.\n\nFiscal measures introduced in the budget and GST 2.0, are seen as pro-spending. Tawakley explained that increased household resources could lead to both consumption and investment, such as purchasing larger homes or bringing forward housing investments, which in turn supports economic activity.\n\nOn portfolio strategy, Tawakley maintains a cautious stance on overvalued segments. Tech and metals sectors face headwinds due to global demand pressures and competitive shifts, while cyclicals like industrials and capital goods remain the preferred focus.\n\nAs the economy regains momentum, the combination of supportive monetary policy, robust corporate balance sheets, and targeted fiscal measures positions India’s cyclical sectors for a meaningful recovery, with banks uniquely poised to capitalise on the evolving market dynamics.\n\nFor the entire discussion, watch the accompanying video",
    "scraped_at": "2025-10-09T08:21:41.721918+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/market/hdfc-bank-share-price-q2-update-gross-advances-deposits-average-casa-aum-19702458.htm",
    "title": "HDFC Bank Q2 Update | Gross advances up 9.9%, deposits average at ₹27.1 lakh crore",
    "content": "HomeMarket NewsHDFC Bank Q2 Update | Gross advances up 9.9%, deposits average at ₹27.1 lakh croreHDFC Bank's gross advances increased 4.4% sequentially from ₹26.53 lakh crore and 9.9% from the previous year's ₹25.19 lakh crore to ₹27.69 lakh crore in the September quarter this fiscal.HDFC Bank Ltd. reported its business update for the second quarter on Saturday, October 4.\n\nIts gross advances increased 4.4% sequentially from ₹26.53 lakh crore and 9.9% from the previous year's ₹25.19 lakh crore to ₹27.69 lakh crore in the September quarter this fiscal.\n\nIts deposits average of ₹27.1 lakh crore increased 15.1% from last year's ₹23.54 lakh crore and was up 2% sequentially from ₹26.57 lakh crore.\nIts average current account savings account (CASA) deposits increased 1.9% sequentially from ₹8.6 lakh crore and 8.5% from last year's ₹8.08 lakh crore to ₹8.77 lakh crore in the September quarter.\n\nHDFC Bank's CASA deposits period end were up 1.3% from the previous quarter's ₹9.37 lakh crore and up 7.4% from the previous year's ₹8.83 lakh crore to ₹9.49 lakh crore in the second quarter this fiscal.\n\nThe lender's assets under management (AUM) average were up 9% from last year's ₹25.63 lakh crore and up 1.9% from the previous quarter's ₹27.42 lakh crore to ₹27.94 lakh crore in the July to September period this fiscal.\n\nShares of HDFC Bank ended the previous session 0.2% lower at ₹963.7 apiece. The stock has gained 8.1% this year, so far.\n\nAlso Read: AU Small Finance Bank Q2 | Total deposits rise to ₹1.32 lakh crore, CASA ratio contracts to 29.4%First Published: Oct 4, 2025 11:14 AM IST",
    "scraped_at": "2025-10-09T08:21:41.864603+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/technology/bharti-airtel-vittal-regulation-falling-behind-tech-changes-india-mobile-congress-19708404.htm",
    "title": "Bharti Airtel’s Vittal warns regulation is falling behind rapid tech changes",
    "content": "HomeTechnology NewsBharti Airtel’s Vittal warns regulation is falling behind rapid tech changesBharti Airtel MD Gopal Vittal says telecom regulation is lagging behind rapid tech changes, calling the broader digital space a “Wild West” while urging efficiency and new revenue streams in India’s competitive market.Bharti Airtel Managing Director Gopal Vittal on Tuesday warned that regulation is struggling to keep pace with rapid technological changes, as the telecom sector faces increasing pressure from the broader digital ecosystem.\n\nSpeaking at the India Mobile Congress, Vittal said regulators are focusing heavily on telecom, which is only a small part of the challenges in trust and security across the digital world.\n“I think regulation needs to keep pace with changes in technology. And I feel regulation is not keeping pace with changes in technology because most regulators today globally, it's not just in India, are focused on the telecom sector, which is a very small part of the surface area of the problems that are being created in trust and security,” he said.\n\nVittal highlighted that while telecom regulation is strict, the larger digital ecosystem remains largely unregulated. “It's like, you have a small part of a ground where there's a lot of action going on, but there's a very large field which is a Wild West. And I think all of these areas need to be addressed,” he added.\n\nThe Airtel chief also touched upon the challenges of operating in India’s telecom market, pointing to low average revenue per user (ARPU) and the demanding nature of Indian customers. “India is a very, very difficult place to operate in because the customer is more demanding than the customers in Europe. Just in terms of the quality of the network, you're operating with the lowest ARPUs and the lowest rate per gigabyte and yet you have to make money,” Vittal said.\n\nHe indicated that there is scope for pricing adjustments and urged telecom players to explore efficiency improvements and new revenue streams. “There is headroom for pricing to go up in India. But that said, I think you just have to be more and more efficient in how you deliver the service and at the same time start looking at alternate revenue streams and new revenue streams,” he said.First Published: Oct 8, 2025 10:00 PM IST",
    "scraped_at": "2025-10-09T08:21:42.330539+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/business/hdfc-bank-retail-loans-traction-festive-demand-arvind-vohra-global-fintech-festival-19707439.htm",
    "title": "HDFC Bank sees strong retail traction across segments, expects festive momentum to sustain",
    "content": "HomeBusiness NewsHDFC Bank sees strong retail traction across segments, expects festive momentum to sustainArvind Vohra of HDFC Bank said the lender is witnessing healthy demand across personal, business, and auto loans, supported by improved consumer sentiment and easing borrowing costs. He added that the bank’s asset quality remains strong and that recent rate cuts will further help boost demand in the months ahead.HDFC Bank is witnessing strong momentum across its retail lending segments and expects the ongoing festive season to further boost consumption, said Arvind Vohra, Group Head of Retail Assets at HDFC Bank, in an interview with CNBC-TV18 on the sidelines of Global Fintech Festival.\n\nVohra said the confluence of three major factors is driving consumption this year—changes in income tax slabs, GST rationalisation, and a downward trend in lending rates. “We are seeing the confluence of three things that have happened this year. The first is the change in income tax slabs in the early part of the year. Then we have the GST rationalisations, which became effective from 22nd of September. And the lending interest rate cycle is anyway on a downward trend,” he said.\n\nThe bank is already seeing positive signs of consumer spending as the festive season begins. “The early signals we are seeing during Navratri, which is really the onset of the festive season in India, are very healthy. We believe that the festive season is going to be good,” Vohra said, adding that the bank is optimistic about the months ahead.\nHe noted that the second half of the financial year typically benefits from festive demand, which should help sustain growth momentum. The bank has also introduced new initiatives to capitalise on the trend. “We have launched a campaign called Festive Treats. Diwali is all about sweets, and these are the treats from the bank’s perspective for all our customers and prospective customers,” he said. The campaign brings together the bank’s best deals, rates, and offers under one umbrella and is supported by express loan journeys to make borrowing faster and more convenient.\n\nVohra said HDFC Bank continues to see healthy traction across all major retail segments, including personal loans, business loans, and auto loans. “In some areas, the traction could be a tad higher compared to others, but broadly, all key segments are showing healthy growth,” he said.\n\nOn concerns around unsecured lending, Vohra clarified that the bank’s asset quality remains robust. “We did not have any stress because we believe that credit prudence is fundamental to banking,” he said. The lender has maintained what he described as a “very pristine portfolio quality” over the last six to eight quarters, across both secured and unsecured books.\n\nHe also said that the recent rate cuts by the Reserve Bank of India are likely to stimulate credit demand over time. “Rate cuts usually mean higher demand. From a medium to long-term perspective, that’s positive news,” he said.\n\nVohra expressed confidence that the combination of supportive policy measures, improving sentiment, and festive demand will continue to sustain retail growth through the second half of the year.First Published: Oct 8, 2025 3:31 PM IST",
    "scraped_at": "2025-10-09T08:21:42.474105+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/market/stocks-end-higher-for-fourth-straight-day-led-by-gains-in-reliance-rail-stocks-19705647.htm",
    "title": "Stocks end higher for fourth straight day led by gains in Reliance, rail stocks",
    "content": "HomeMarket NewsStocks end higher for fourth straight day led by gains in Reliance, rail stocksThe NSE Nifty 50 rose 31 points, or 0.12%, to 25,108, while the S\u0026P BSE Sensex gained 137 points, or 0.17%, to close at 81,927. Despite the upmove, market breadth favoured declines, with mid- and small-cap stocks showing mixed trends. The Nifty Midcap 100 climbed 274 points to 58,289.The stock market closed higher on Tuesday, extending gains for a fourth straight session, though profit-taking in select banking and consumer stocks capped broader market advances.\n\nThe NSE Nifty 50 rose 31 points, or 0.12%, to 25,108, while the S\u0026P BSE Sensex gained 137 points, or 0.17%, to close at 81,927. Despite the upmove, market breadth favoured declines, with mid- and small-cap stocks showing mixed trends. The Nifty Midcap 100 climbed 274 points to 58,289.\n\n\n\n\n\n\n\n\n\n\n“The markets are trying to hold the critical support at 24,440-24,337 and they've come back to about 25,200. The markets are facing very important headwinds in the form of macro headwinds. While Reliance is showing some positive signs, I don't know if the local factors will trump over the global macro. So, I suspect the global macro will win over the local factors,” said Jai Bala, a Certified Financial Technician at Cashthechaos.com.\n\n\n\n\n\n\n\n\n\n\n\n\nBanking and energy shares provided most of the support. The Nifty Bank index rose 135 points to 56,239, led by gains in ICICI Bank and SBI, even as Axis Bank and Kotak Mahindra Bank saw profit booking. Reliance Industries added nearly 1%, extending its recent momentum and contributing the most to Nifty’s upside.\nAmong sectoral movers, telecom and rail stocks outperformed. Vodafone Idea jumped nearly 9% after positive developments in the adjusted gross revenue (AGR) case, while Bharti Airtel rose 1% on signs of improved subscriber additions. Indus Towers also advanced.\n\nRailway-linked stocks surged after the Cabinet cleared projects worth ₹24,000 crore. IRCON International rallied 7%, while Titagarh Rail Systems gained over 4%.\n\nIndraprastha Gas Ltd (IGL) surged 6% following reports of a potential change in the tax framework for gas sourcing. Dreamfolks Services rose 5% after announcing its entry into the B2C segment.\n\nOn the downside, Tata Motors fell 2% despite its Jaguar Land Rover unit resuming production at one plant. Trent slipped 2% after reporting subdued Q2 growth. Life insurance stocks ended mixed — HDFC Life and Max Financial declined, while SBI Life gained.\n\nIn the midcap segment, Divi’s Laboratories, Titagarh Rail, Torrent Power, Amber Enterprises, and Federal Bank were among the top gainers, whereas CESC, Jindal Steel and Power, Britannia, HDFC Asset Management, Bank of Baroda, and Hindustan Copper were the top laggards.First Published: Oct 7, 2025 3:38 PM IST",
    "scraped_at": "2025-10-09T08:21:42.619062+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/personal-finance/zomato-hdfc-pension-launch-nps-model-for-gig-workers-national-pension-system-19700768.htm",
    "title": "Zomato, HDFC Pension launch NPS model for gig workers",
    "content": "The model, enabled through Kfintech’s digital infrastructure, is aimed at improving long-term financial security for gig workers associated with Zomato.Zomato has partnered with HDFC Pension to introduce a National Pension System (NPS) model tailored for platform-based delivery partners. The initiative, called the ‘NPS Platform Workers Model’, was formally launched on October 1 in New Delhi by Finance Minister Nirmala Sitharaman at an event organised by the Pension Fund Regulatory and Development Authority (PFRDA) to mark NPS Diwas.\n\nThe model, enabled through Kfintech’s digital infrastructure, is aimed at improving long-term financial security for gig workers associated with Zomato.\n\nAccording to the companies, onboarding is being done through digital integration using existing KYC or e-KYC details, with the workers’ consent. Additional information can be shared later.\nOver 30,000 delivery partners have already generated their Permanent Retirement Account Numbers (PRANs) within 72 hours of the rollout. Zomato has set a target of enabling more than one lakh delivery partners to open NPS accounts by the end of 2025.\nIndia has an estimated 23.5 million platform workers projected by FY2030, according to a 2022 NITI Aayog report. Industry studies have highlighted limited awareness and access to formal retirement savings among gig workers, leading to negligible participation in pension schemes.\n\nUnder the new model, eligible delivery partners can make small, periodic contributions and build retirement savings that can be withdrawn as a lump sum and pension upon retirement. The framework also allows portability, enabling workers to retain their accounts as they move across roles or platforms.\n\nSriram Iyer, Managing Director and CEO of HDFC Pension, said the initiative is intended to broaden access to retirement planning among individuals who are typically excluded from formal schemes.\n\nAditya Mangla, CEO of Zomato, said the collaboration supports long-term financial security for delivery partners.\n\nZomato reported an average of about 5.09 lakh independent monthly active delivery partners in Q1 FY26. The company currently offers health insurance, accident cover, SOS assistance, rest points and other support services at no cost to partners.\n\nHDFC Pension, a subsidiary of HDFC Life, is licensed by PFRDA as both a Pension Fund Manager and a Point of Presence for NPS subscribers.First Published: Oct 2, 2025 12:52 PM IST",
    "scraped_at": "2025-10-09T08:21:42.822485+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/business/finance/hdfc-bank-senior-management-member-rahul-shyam-shukla-resigns-19700761.htm",
    "title": "HDFC Bank senior management member Rahul Shyam Shukla resigns",
    "content": "According to the bank, Shukla resigned due to personal reasons, and his resignation has been accepted. No successor has been named in the filing.HDFC Bank has announced the resignation of senior management personnel Rahul Shyam Shukla, effective October 1, 2025. The disclosure was made in a regulatory filing to the BSE and NSE under Regulation 30 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015.\n\nAccording to the bank, Shukla resigned due to personal reasons, and his resignation has been accepted. No successor has been named in the filing.\nThe bank attached the required details in Annexure I and Annexure II, including the timeline of cessation and the resignation letter. Shukla, who previously went on sabbatical, formally submitted his resignation on October 1.\nIn his letter, he expressed gratitude to his colleagues and reflected on his experience across areas such as agricultural finance, SME banking and microfinance operations. He credited the institution for the autonomy and exposure provided during his tenure.\n\nALSO READ | Marriott Bonvoy, HDFC Bank, Flipkart introduce rewards for credit card users(Edited by : Anshul)First Published: Oct 2, 2025 12:25 PM IST",
    "scraped_at": "2025-10-09T08:21:43.025613+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/market/stocks/ed-conducts-surveys-at-reliance-infrastructure-share-price-premises-say-sources-19698636.htm",
    "title": "ED conducts surveys at Reliance Infrastructure premises, say sources",
    "content": "Reliance Infrastructure clarified that the matter relates to an issue dating back 15 years. In 2010, the company awarded an EPC contract for the Jaipur–Ringus Highway (JR Toll Road) to Prakash Asphaltings \u0026 Toll Highways, a domestic contract with no foreign exchange involvement. Shares of Reliance Infrastructure Ltd ended at ₹242.15, down by ₹5.10, or 2.06%, on the BSE.The Enforcement Directorate (ED) is conducting searches at six Reliance Infrastructure Limited premises in Indore and Mumbai under FEMA in connection with alleged illegal remittances abroad on Tuesday (September 30), sources told CNBC TV18.\n\nReliance Infrastructure clarified that the matter relates to an issue dating back 15 years. In 2010, the company awarded an EPC contract for the Jaipur–Ringus Highway (JR Toll Road) to Prakash Asphaltings \u0026 Toll Highways, a domestic contract with no foreign exchange involvement.\nAlso Read: Reliance Infra cedes control in Dassault Aviation JV with ₹176 cr stake sale\nThe work has been completed, and the toll road has been with NHAI for the past four years. The company added that it and its officials are fully cooperating with the authorities. It also noted that the ED action has no impact on its business operations, financial performance, shareholders, employees, or other stakeholders.\n\nShares of Reliance Infrastructure Ltd ended at ₹242.15, down by ₹5.10, or 2.06%, on the BSE.",
    "scraped_at": "2025-10-09T08:21:43.231325+05:30"
  },
  {
    "url": "https://www.cnbctv18.com/market/stocks/icici-lombard-share-price-receives-rs-1901-crore-gst-demand-for-july-2017-march-2022-plans-appeal-19698714.htm",
    "title": "ICICI Lombard receives ₹1,901 crore GST demand for July 2017–March 2022, plans appeal",
    "content": "HomeMarket NewsStocks NewsICICI Lombard receives ₹1,901 crore GST demand for July 2017–March 2022, plans appealThe company clarified that the order has no impact at this stage on its financial position or operations. It also noted that there are no non-compliances identified beyond the matters mentioned, and the communication does not involve any litigation against key management personnel or promoters. Shares of ICICI Lombard General Insurance Co Ltd ended at ₹1,884.85, down by ₹20.00, or 1.05%, on the BSE.Private sector non-life player ICICI Lombard General Insurance Company Limited, on Tuesday (September 30), said it has received an order from the Additional Commissioner, CGST \u0026 Central Excise Palghar Commissionerate, confirming a GST demand and penalty together amounting to about ₹1,901 crore, along with interest under Section 50 of the CGST Act, 2017, for the period July 2017 to March 2022.\n\nThe demand comprises ₹1,728.86 crore of GST and a penalty of ₹172.89 crore. The order pertains to industry-wide issues, including non-payment of GST on co-insurance premiums received as a follower in co-insurance transactions and on re-insurance commissions deducted from premiums ceded to Indian and foreign reinsurers.\nAlso Read: IRDAI starts action on 8 insurers over health portfolio lapses; ICICI Lombard, New India respond\n\nThe matter had been previously re-adjudicated, and despite circulars issued by the GST Council and the Council’s 53rd meeting on June 22, 2024, the order confirms the demand. ICICI Lombard stated it will pursue an appeal or evaluate other appropriate actions, including filing a writ petition.\n\nThe company clarified that the order has no impact at this stage on its financial position or operations. It also noted that there are no non-compliances identified beyond the matters mentioned, and the communication does not involve any litigation against key management personnel or promoters.\n\nShares of ICICI Lombard General Insurance Co Ltd ended at ₹1,884.85, down by ₹20.00, or 1.05%, on the BSE.\n\n\n\nAlso Read: ICICI Lombard Q1 Results | Net profit surges 29% to ₹747 crore; Net premium earned up 14%First Published: Sept 30, 2025 9:10 PM IST",
    "scraped_at": "2025-10-09T08:21:43.494838+05:30"
  },
  {
    "url": "https://www.thehindubusinessline.com/markets/brokers-call-sbi-cards-neutral/article70139262.ece",
    "title": "Broker’s call: SBI Cards (Neutral)",
    "content": "Target: ₹950CMP: ₹920.00SBI Cards and Payment Services (SBI Cards) is the second-largest player in the card industry with 19.1 per cent share in CIF and 16.6 per cent share in total industry spends. However, its market share in spends has declined over the past few years, mainly due to the moderation in corporate spends. Growth in retail spend has though remained healthy.\nSBI Cards has been the beneficiary of rate cuts, as its CoF has declined by 30bp during the latest repo cuts, while further benefits are yet to be realised. With high prospects of additional rate cuts, SBICARD can see a further reduction in CoF.We anticipate the near-term credit cost to stay elevated, although an easing in credit cost and tailwinds in margins should lead to an improvement in return ratios. Thus, we build in an improvement in RoA toward 3.8 per cent in FY26E, 4.6 per cent in FY27E and 4.8 per cent in FY28E.With some pickup in economic activity from the current levels, we expect the tailwinds to flow into better spends and loan growth. Thus, we expect spends to clock 18 per cent CAGR over FY25-28E and loans to see about 15 per cent CAGR over the similar period. \nWe maintain our Neutral rating on the stock with a TP of ₹950 .Published on  October 8, 2025",
    "scraped_at": "2025-10-09T08:21:44.0645+05:30"
  },
  {
    "url": "https://www.thehindubusinessline.com/markets/flat-opening-seen-for-indian-markets-ahead-of-tcs-results/article70137908.ece",
    "title": "Flat opening seen for Indian markets ahead of TCS results",
    "content": "Foreign portfolio investors are likely to be in focus today\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe domestic markets are expected to open on flat note on Wednesday amid mixed global cues. All eyes will be on TCS, which is scheduled to declare its Q2 results today. Analysts say the focus will be on comments on outlook, recent job cuts that have triggered controversy, imbroglio in the Tata group, etc.Experts said the focus will also be on FPI behaviour. Foreign portfolio investors turned buyers after a long gap on Tuesday. Experts believe the selling intensity will reduce going forward given the expected rate cut in the US and a slew of positives in the domestic market.Ponmudi R, CEO of Enrich Money, said: On the macro front, India’s growth narrative remains resilient, underpinned by robust infrastructure spending, steady consumer demand, and healthy credit growth. Despite global headwinds — including elevated US tariffs and sluggish world trade — the economy continues to display strong momentum. While the rupee has seen mild pressure amid foreign fund outflows, sustained domestic investor participation is helping anchor market stability and confidence.  Gift Nifty at 25,225 indicates a flattish opening.Meanwhile, equities across the Asia-Pacific region were little changed in early deals on Wednesday, though US stocks slipped overnight.Published on  October 8, 2025",
    "scraped_at": "2025-10-09T08:21:44.137036+05:30"
  },
  {
    "url": "https://www.thehindubusinessline.com/markets/stock-markets/mid-market-sensex-jumps-over-450-pts-nifty-touches-25200-mark-jio-financial-bharti-airtel-hdfc-bank-lead-gainers/article70134357.ece",
    "title": "Top gainers \u0026 losers 7th Oct 2025: Sensex jumps over 450 pts, Nifty touches 25,200 mark, Jio Financial, Bharti Airtel \u0026 HDFC Bank lead gainers",
    "content": "Equity benchmark indices zoomed after a flat opening, led by banking, financial and consumer durables in the mid-trading session.Investor sentiment has been further bolstered by the RBI’s recent lending reforms. Market experts also point to optimistic business updates from companies ahead of the September-quarter earnings season as a contributing factor to the market’s rally.Sensex traded 426.82 pts or 0.52 per cent higher at 82,216.94 at 1.22 pm against the previous close of 81,790.12. Nifty 50 climbed 115.75 pts or 0.46 per cent to 25,193.40 ( after hitting an intraday high of 25,202.20) against the previous close of 25,077.65.Nifty midcap 100 and smallcap indices traded with 0.46 per cent and 0.39 per cent gains, respectively. On the sectoral front, all indexes except media, FMCG, PSU Bank and IT, traded in the positive territory.Top gainers \u0026 losers todayNifty 50 components Jio Financial Services, Bharti Airtel, Eicher Motors, HDFC Bank and HCL Tech led the gainers, while Trent, Tata Motors, Axis Bank, HDFC Life, Tata Consumer Products and Hindalco traded as major laggards.About 3,087 stocks were traded on the National Stock Exchange, of which 1,407 advanced, 1,573 declined, and 107 remained unchanged. 96 stocks, including Aether Energy, Avalon and Canara Bank, hit their 52-week high, while 71 stocks, including EaseMyTrip, touched their 52-week low. In addition, 95 stocks were in the upper circuit and 53 stocks in the lower circuit.Midcap \u0026 smallcap moversUnder the midcap segment, Vodafone Idea, IGL, Nykaa, Torrent Power, Bharti Hexacom and Federal Bank soared 3-7 per cent. Coromandel International, HDFC AMC, BDL, LIC Housing Finance and Fortis Healthcare declined 1-2 per cent.Smallcap stocks BLS International, Aditya Birla Real Estate, Star Health, CDSL, Neuland Lab surged 3-5 per cent, while Shyam Metalics, Aegis Logistics, Aegis Vopak, Lal Path Labs depreciated 2-3 per cent.Published on  October 7, 2025 Companies to followBharti Airtel LtdEicher Motors LtdHDFC Bank LtdHCL Technologies LtdTata Motors LtdAxis Bank LtdHDFC Life Insurance Company LtdTata Consumer Products LtdHindalco Industries Ltd",
    "scraped_at": "2025-10-09T08:21:44.232262+05:30"
  },
  {
    "url": "https://www.thehindubusinessline.com/markets/stock-markets/icici-bank-launches-premium-forex-card-for-business-travellers-in-visa-partnership/article70134053.ece",
    "title": "ICICI Bank launches premium Forex Card for business travellers in Visa partnership",
    "content": "Travel background with credit card in orange color\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t| Photo Credit:\n\t\t\t\t\t\t\t\t\t\t\tTalaj\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe shares of ICICI Bank were trading on the NSE today at ₹1,377.10 up by ₹13.70 or 1 per cent at 11.45 am. \nICICI Bank and Visa unveiled the Corporate Sapphiro Forex Card, marking the first time a bank in Asia has offered a prepaid card powered by Visa Infinite, the payment network’s premium platform. \nThe forex card targets entrepreneurs and corporate leaders travelling internationally for work, combining prepaid convenience with premium benefits. Customers can load and transact in 15 currencies with zero cross-currency markup charges, enabling travel across multiple countries even with a single loaded currency. Card benefits include two complimentary international airport lounge visits, meet-and-assist services and a complimentary international eSIM card. The package, valued at over ₹15,000, also features three monthly ATM fee waivers and preferential rates with global hotel chains and airlines. Each welcome kit includes both a primary card and a backup replacement card. ICICI Bank has introduced an end-to-end digital application process through its InstaBIZ business banking app, allowing entrepreneurs and sole proprietors with current accounts to apply, activate and load the card instantly. The service will expand to large corporate employees and be available on Corporate Internet Banking shortly. The card carries a joining fee of ₹2,999 plus GST. Vipul Agarwal, Head of Cards \u0026 Payment Solutions at ICICI Bank, said the innovation addresses the growing international expansion of Indian businesses. The partnership demonstrates both companies’ focus on business payment innovation and curated customer experiences for the corporate travel segment. Published on  October 7, 2025",
    "scraped_at": "2025-10-09T08:21:44.333168+05:30"
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tcs-pvr-inox-senco-gold-jsw-cement-maruti-suzuki/articleshow/124402285.cms",
    "title": "Stocks in news: TCS, PVR Inox, Senco Gold, JSW Cement, Maruti Suzuki",
    "content": "Markets traded sideways on Wednesday and ended with a mild downtick, taking a breather after the recent surge.With the earnings season underway, focus now shifts to TCS’s quarterly results, scheduled for Thursday, October 9. As IT remains one of the lagging sectors, market participants will closely watch how sentiment evolves post its numbers.On the index front, analysts said indications point toward further consolidation, albeit with a positive bias. In today's trade, shares of TCS, PVR Inox, Senco Gold, JSW Cement, Maruti Suzuki among others will be in focus due to various news developments.TCSTCS will kick off the earnings season on Thursday, with brokerages estimating Q2 net profit growth of 3.7%–9.6% YoY, pegging the bottomline between Rs 12,346 crore and Rs 13,058 crore. Revenue is projected in the range of Rs 64,200–65,700 crore, reflecting a 0.7%–2.2% uptick compared to the same quarter last year.PVR InoxPVR Inox launched 'dine-in cinema', claimed to be India's first, at M5 ECity Mall in Bengaluru. The multiplex operator said the dine-in cinema is a first-of-its-kind experience where \"blockbuster films meet gourmet dining\". This format transforms the cinema into a lifestyle destination, giving audiences the freedom to enjoy chef-curated meals in-seat, without stepping out of the auditorium or even purchasing a movie ticket.LupinDrug firm Lupin will set up a new manufacturing facility in Coral Springs, Florida, entailing an investment of $250 million. The Florida-based plant would produce products like albuterol inhalers for children with asthma. By strengthening domestic manufacturing and enhancing supply chain diversification, this critical project will enhance medicine security and strengthen the company's position as a global respiratory leader, it said.Maruti SuzukiMaruti Suzuki India said it plans to add a total of 500 service workshops to its network in the current fiscal. The auto major announced the setting up of its 5,000th Arena Service touchpoint in Coimbatore. The company sells its product range in the country through Arena and Nexa sales networks.JSW CementJSW Cement, part of diversified $23-billion JSW Group has commissioned a 1 MTPA (million tonnes per annum) capacity cement grinding unit at Sambalpur in Odisha. The unit, which will take the company's total installed capacity to 21.6 MTPA, is being commissioned through its subsidiary, Shiva Cement, according to a statement.Senco GoldJewellery retailer Senco Gold reported a 6% YoY growth in total revenue for the second quarter (Q2FY26), despite headwinds from record-high gold prices and seasonal factors.Saatvik Green EnergySeptember listed Saatvik Green Energy posted a 459% jump in its consolidated net profit for the June ended quarter at Rs 119 crore versus Rs 21 crore reported in the year ago period. The profit after tax (PAT) is attributable to the owners of the group.",
    "scraped_at": "2025-10-09T08:21:44.496323+05:30"
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-revenue-to-inch-up-margins-may-shrink-in-q2/articleshow/124402208.cms",
    "title": "TCS revenue to inch up, margins may shrink in Q2",
    "content": "ET Intelligence Group: Tata Consultancy Services may report a modest sequential uptick in dollar denominated revenue for the September quarter compared with a drop in the previous quarter. However, the operating margin (EBIT margin) and net profit may show weakness amid lower employee utilisation and the impact of partial salary increase. The company will declare the quarterly numbers on Thursday after market hours.According to the average of the estimates by ETIG and six brokerages, the country's largest IT exporter will report 0.6% sequential growth in revenue at $7,473 million after posting a 0.6% fall in the prior quarter. In rupee terms, the growth rate will be higher at 2.8% taking the revenue to ₹65,242.4 crore due to favourable currency movement during the quarter. The rupee depreciated by 2% sequentially against the dollar during the quarter on average. A weaker domestic currency improves realisation of exporters. Agencies\"TCS is expected to post revenue growth of 1.0% quarter-on-quarter in constant currency terms, with international business growing by around 1% and India flat,\" mentioned Motilal Oswal Financial Services in a preview report. The broking firm expects a ramp up in the BSNL project from the December quarter. A winding down in the local telecom operator's 4G project had pulled down the top line in the previous quarter by 2.8% taking the total revenue drop to 3.3% in constant currency terms.The operating margin is expected to shrink by 10-20 basis points from 24.5% in the previous quarter following partial wage increase and lower utilisation. Net profit is likely to fall by 1.6% sequentially to ₹12,560.5 crore. In the prior quarter, it had risen significantly by 4% on account of one-time tax refund.\"We expect TCS to report a 20 basis points sequential contraction in margin given the impact of one month wage hike and lower utilisation,\" stated Elara Capital in a preview report highlighting that the non-recurring nature of the tax refund would impact profitability sequentially.The stock has lost 11% since July 09 when the company had declared the June quarter numbers following demand weakness. In this backdrop, investors would keenly track the September quarter performance to find cues on the deal pipeline and its conversion rate, hiring and margin outlook among other factors.",
    "scraped_at": "2025-10-09T08:21:44.574811+05:30"
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/kyc-a-challenge-have-to-simplify-norms-sbi-chief/articleshow/124402003.cms",
    "title": "KYC a challenge, have to simplify norms: SBI chief",
    "content": "Mumbai: State Bank of India chairman CS Setty called upon policymakers, fintech developers and technology developers to think about ways to simplify the know your customer (KYC) process, which he termed one of the biggest challenges for banks as well as customers.Banks employ KYC to onboard customers and simplifying the process is important for a large number of people who are joining mainstream banking.\"I think one (of the) biggest subjects both on the customer side and the bank side... it's about KYC. We are working on the simplification of KYC processes. Even if it means that we need to engage with the regulators and the government, we are taking that initiative from the SBI side to simplify the whole process of KYC,\" Setty said Wednesday.Under YONO 2.0, the upcoming version of SBI's digital platform, the bank plans to offer the option of multiple languages, he said. \"Almost 15 languages will be available in YONO 2.0. And we would like to focus on how we make more and more products available for farmers, MSME (micro, small and medium enterprises) customers, and also the branch and community customers,\" Setty said. SBI is focusing on physical presence as well, he said, adding, \"We have about 1.6 lakh touch points. It is not only digital channels; we are also reimagining physical outlets to ensure services are accessible across the country.\"",
    "scraped_at": "2025-10-09T08:21:44.680282+05:30"
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/shift-to-new-provisioning-ways-to-have-little-impact-sbi-chairman-cs-setty/articleshow/124401996.cms",
    "title": "Shift to new provisioning ways to have little impact: SBI chairman CS Setty",
    "content": "Mumbai: The long transition provided to banks on the new expected credit loss (ECL) provision guidelines will limit the impact on bank balance sheets, State Bank of India (SBI) chairman CS Setty said Wednesday.The comments came a day after the Reserve Bank of India (RBI) issued a draft circular on the ECL framework, which will replace incurred-loss-based provisioning framework that banks use currently.The central bank has proposed 100% provisions against unsecured loans after one year of these loans being classified as credit impaired, while all other categories of loans will attract 100% provisions after four years of such classification.In a big relief to banks, the RBI has proposed that the new norms come into effect only from April 1, 2027. Besides, banks will get four years, till March 31, 2031, to make additional provision on their existing books. The central bank has invited public comments on the draft guidelines until November 30 following its announcement in the monetary policy review last week. Setty said SBI is ready technologically, in terms of models and networks to implement the new guidelines.",
    "scraped_at": "2025-10-09T08:21:44.856216+05:30"
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-q2-results-preview-pat-likely-to-grow-up-to-10-yoy-5-key-things-to-track/articleshow/124379844.cms",
    "title": "TCS Q2 Results Preview: PAT likely to grow up to 10% YoY; 5 key things to track",
    "content": "Indian IT bellwether Tata Consultancy Services (TCS) will kick off the Q2 earnings season on Thursday, with brokerages estimating net profit growth of 3.7%-9.6% YoY, putting the bottomline in the range of Rs 12,346–13,058 crore. Revenue is projected at Rs 64,200-65,700 crore, reflecting a 0.7%-2.2% rise from the same quarter last year.Estimates are based on inputs from Nomura, Nuvama Institutional Equities, Motilal Oswal Financial Services, Axis Securities, and HDFC Securities.Among brokerages, HDFC Securities has the most conservative PAT estimate, while Nuvama is the most bullish. On the topline, Nuvama expects lower revenue, whereas Axis forecasts the highest among its peers.Margins are expected to remain stable YoY, though most analysts anticipate a sequential decline.The quarter faced macroeconomic headwinds and pricing pressures, which dampened overall industry revenues as clients remained cautious on large or discretionary spending.Brokerages will closely watch the company’s commentary on key issues, including the H-1B fee hike, guidance, and deal pipeline.TCS Q2FY26: Brokerages suggest expectations on 5 key parameters1) PAT- Nomura: Rs 12,441 crore, up 4.5% YoY, down 2.5% QoQ- Nuvama: Rs 13,058 crore, up 9.6% YoY, up 2.3% QoQ- Motilal Oswal: Rs 12,600 crore, up 5% YoY, down 2.1% QoQ- Axis Securities: Rs 12,874 crore, up 7.7% YoY, up 0.4% QoQ- HDFC Securities: Rs 12,346 crore, up 3.7% YoY, down 3.2% QoQ2) Revenue- Nomura: Rs 64,259 crore, up 1.4% YoY, up 2.7% QoQ0.5% QoQ decline in constant currency (CC) due to lower BSNL contribution and modest growth in developed markets.- Nuvama: Rs 64,738 crore, up 0.7% YoY, up 2.1% QoQModest 0.2% QoQ CC/USD growth as India business remains flat after BSNL ramp-down.- Motilal Oswal: Rs 65,400 crore, up 1.8% YoY, up 3.1% QoQExpects 1% QoQ CC growth; India topline flat, international business up 1%.- Axis Securities: Rs 65,682 crore, up 2.2% YoY, up 3.5% QoQGrowth led by BFSI, Hi-tech, and cross-currency tailwinds.- HDFC Securities: Rs 65,045 crore, up 1.2% YoY, up 2.5% QoQ3) EBIT- Nuvama: Rs 15,970 crore, up 3.3% YoY, up 2.9% QoQ- Axis Securities: Rs 15,928 crore, up 3% YoY, up 2.7% QoQ- HDFC Securities: Rs 15,849 crore, up 2.5% YoY, up 2.2% QoQ4) EBIT MarginApart from Nuvama and Nomura, most brokerages expect margins to slip sequentially due to wage hikes, talent investments, lower utilization, and reduced BSNL contribution.- Nomura: 24.1%, up 40 bps YoY, flat QoQ- Nuvama: 24.7%, up 60 bps YoY, up 20 bps QoQ- Motilal Oswal: expects EBIT margin to decline 20 bps QoQ- HDFC Securities: 24.4%, up 30 bps YoY, down 9 bps QoQ5) Key Monitorables- Nomura: Outlook on restructuring, client discretionary spending amid US macro volatility, cost takeout projects, BFSI vertical, deal wins ($7–9 billion excluding mega deals).- Nuvama: Adds monitoring of employee restructuring updates.- Motilal Oswal: Near-term demand, tech budgets, BFSI vertical, deal wins, GenAI transition, pricing and delivery realignment.- Axis Securities: H1B visa impact, BSNL advance purchase order.(Disclaimer: The recommendations, suggestions, views, and opinions given by the experts are their own. These do not represent the views of The Economic Times.)",
    "scraped_at": "2025-10-09T08:21:45.012798+05:30"
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/tech-trouble-nifty-it-sinks-but-infosys-and-hcl-tech-emerge-as-buy-opportunities/articleshow/124378884.cms",
    "title": "Tech Trouble: Nifty IT sinks, but Infosys and HCL Tech emerge as “BUY” opportunities",
    "content": "India's once-resilient IT sector is showing signs of fatigue, as heavyweight stocks like TCS, Infosys, and HCL Technologies have tumbled over 10% in the past three months. The Nifty IT Index, a key barometer of sector performance, has dropped by nearly 11%, with 9 out of 10 stocks in the red — the lone exception being Oracle Financial Services Software.The sharp correction comes amid mounting macroeconomic headwinds, softer client spending, and increasing pricing pressure, all casting a long shadow over revenue growth for FY26.The recent market correction has pushed IT sector valuations down from their peak levels. The sector now trades at 21.7 times forward earnings, roughly 14% below its five-year average. According to the HDFC Securities report, this valuation reset has made tier-1 IT companies more attractive, leading analysts to upgrade Infosys and HCL Technologies to a 'BUY' rating.HDFC Securities points to multiple headwinds dragging down the sector’s performance. The brokerage firm has cut its FY26 and FY27 revenue estimates by approximately 1%, citing a softer-than-expected first half of the fiscal year. While some deal activity has started to pick up, clients remain cautious amid global macroeconomic uncertainty and geopolitical tensions, especially in the U.S., where tariff-related fears and a recent H1B visa fee hike have made offshore outsourcing more complex and potentially more expensive.Despite this challenging backdrop, some green shoots are emerging — particularly in AI and cost optimisation deals. Generative AI (GenAI), once feared to be deflationary, is now driving full-scale projects across sectors. This trend has already been reflected in Accenture’s recent commentary, and Indian IT majors are expected to benefit from similar initiatives, which are slowly moving beyond pilot stages.Muted Growth Expected in Q2FY26Despite being a traditionally strong seasonal quarter, Q2FY26 is expected to show muted sequential growth across the Indian IT sector. Among tier-1 players, Infosys and LTIMindtree are forecasted to lead with +1.8% quarter-on-quarter growth in constant currency terms, while others like TCS, HCL Tech, Wipro, and Tech Mahindra are likely to post flat sequential performance.In the mid-tier segment, Persistent Systems, Mphasis, and L\u0026T Technology Services are projected to report relatively strong growth. In contrast, Birlasoft, Tata Elxsi, and Cyient may underperform due to weak client demand and slower ramp-ups in specific verticals.FY26 Outlook: Cautious Optimism with Stable GuidanceLooking ahead, the outlook for the remainder of FY26 remains cautiously optimistic. Most IT companies are expected to maintain their revenue and margin guidance despite persistent macroeconomic pressures. Infosys is likely to retain its 1–3% revenue growth forecast, while HCL Tech is expected to stick to its 3–5% growth guidance.Although the sector continues to face pricing pressures and challenges from evolving delivery models, factors such as rupee depreciation and subdued hiring may help stabilise operating margins in the near term.Also read: 3 factors taking the charm away from Tata Capital IPO. Is it still a buy on last day?Valuations Adjust, Upgrades for Tier-1 PlayersThe broader market correction has brought IT sector valuations off their recent highs. Currently, the sector is trading at 21.7x forward earnings, which is about 14% below its five-year average. This adjustment has made tier-1 IT companies appear reasonably valued, prompting HDFC Securities to upgrade Infosys and HCL Technologies to a “BUY” rating, setting a target price of Rs 1,800 for Infosys and Rs 1,740 for HCL Tech.However, mid-tier IT companies remain relatively expensive, despite recent underperformance, which may limit near-term upside in that segment.What Lies Ahead: A Selective RecoveryWhile short-term risks persist — including U.S. policy uncertainty, rising visa costs, and continued caution in client spending — the Indian IT sector may be positioning for a stronger finish to FY26. Analysts expect AI-led transformation, cost optimisation, and digital modernisation initiatives to drive recovery in deal activity.Given the uneven recovery, analysts recommend a selective investment strategy, focusing on companies with strong deal pipelines, stable margins, and resilience in operations.Nifty IT Stock PerformanceETMarkets.com(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)",
    "scraped_at": "2025-10-09T08:21:45.102889+05:30"
  }
]